{
  "am": "አማርኛ",
  "ar": "عربى",
  "bg": "български",
  "bn": "বাংলা",
  "ca": "Català",
  "cs": "čeština",
  "da": "dansk",
  "de": "Deutsche",
  "el": "Ελληνικά",
  "en": "English",
  "es": "Español",
  "et": "Eestlane",
  "fa": "فارسی",
  "fi": "Suomalainen",
  "fil": "Pilipino",
  "fr": "français",
  "gu": "ગુજરાતી",
  "he": "עִברִית",
  "hi": "हिंदी",
  "hr": "Hrvatski",
  "hu": "Magyar",
  "id": "Bahasa Indonesia",
  "it": "Italiano",
  "ja": "日本語",
  "kn": "ಕನ್ನಡ",
  "ko": "한국어",
  "lt": "Lietuvis",
  "lv": "Latvietis",
  "ml": "മലയാളം",
  "mr": "मराठी",
  "ms": "Bahasa Melayu",
  "nl": "Nederlandse",
  "no": "norsk",
  "pl": "Polskie",
  "pt_BR": "Portugues (brasil)",
  "pt_PT": "Portugues (Portugal)",
  "ro": "Română",
  "ru": "Русский",
  "sk": "Slovák",
  "sl": "Slovenščina",
  "sr": "Српски",
  "sv": "svenska",
  "sw": "Kiswahili",
  "ta": "தமிழ்",
  "te": "తెలుగు",
  "th": "ไทย",
  "tr": "Türk",
  "uk": "Український",
  "vi": "Tiếng Việt",
  "zh_CN": "中文（中国）",
  "zh_TW": "中文（台灣）",
  "...": "Φόρτωση",
  "Settings": "Ρυθμίσεις",
  "Save": "Σώσει",
  "Language": "Γλώσσα",
  "Save settings": "Αποθηκεύσετε τις ρυθμίσεις",
  "You can adjust all by your preference": "Μπορείτε να προσαρμόσετε όλα με την προτίμησή σας",
  "Cancel": "Ματαίωση",
  "Confirm": "Επιβεβαιώνω",
  "Are you sure?": "Είσαι σίγουρος?",
  "Create a password": "Δημιούργησε έναν κωδικό",
  "This password never changes so use a strong one that you'll remember. We recommend to use for storing": "Αυτός ο κωδικός πρόσβασης δεν αλλάζει ποτέ έτσι να χρησιμοποιήσετε ένα ισχυρό που θα θυμάστε. Συνιστούμε να χρησιμοποιήσετε για την αποθήκευση",
  "{charLength} or more characters": "{charLength} ή περισσότερους χαρακτήρες",
  "1 lowercase letter": "1 πεζά γράμμα",
  "1 capital letter": "1 κεφαλαίου",
  "1 number": "1 αριθμός",
  "1 special character": "1 ειδικό χαρακτήρα",
  "Save password": "Αποθήκευση κωδικού",
  "At least 10 symbols": "Τουλάχιστον 10 σύμβολα",
  "Confirm password": "Επιβεβαίωση Κωδικού",
  "Password": "Κωδικός πρόσβασης",
  "Keystore file confirmed": "Το αρχείο keystore επιβεβαίωσε",
  "Remember": "Θυμάμαι",
  "TOS": "Η αποθήκευση του κωδικού πρόσβασής σας και η δημιουργία αντιγράφων ασφαλείας του πορτοφολιού σας είναι <strong> ευθύνη σας </strong>. Αυτό είναι σημαντικό για τη διατήρηση του ασφαλούς κρυπτογράφησης.",
  "I understand": "καταλαβαίνω",
  "go back": "Πήγαινε πίσω",
  "Welcome!": "Καλως ΗΡΘΑΤΕ!",
  "Creating a wallet is easy and secure. All accounts are encrypted locally in your browser, not on remote servers.": "Η δημιουργία ενός πορτοφολιού είναι εύκολη και ασφαλής. Όλοι οι λογαριασμοί είναι κρυπτογραφημένοι τοπικά στο πρόγραμμα περιήγησης, όχι σε απομακρυσμένους διακομιστές.",
  "Create a wallet": "Δημιουργήστε ένα πορτοφόλι",
  "Restore a wallet": "Επαναφέρετε ένα πορτοφόλι",
  "Learn more about this wallet app": "Μάθετε περισσότερα σχετικά με αυτήν την εφαρμογή πορτοφολιού",
  "Back": "Πίσω",
  "Wallet password": "Κωδικός πρόσβασης πορτοφολιού",
  "Upload": "Μεταφόρτω",
  "Keystore file": "Αρχείο κλειδιού",
  "Unlock": "Ξεκλείδωμα",
  "Keystore password": "Keystore κωδικός πρόσβασης",
  "Restore": "Επαναφέρω",
  "Make your choice": "Κάνε την επιλογή σου",
  "Complete": "Πλήρης",
  "Process end": "Τέλος διαδικασίας",
  "Make it good": "Το κάνει καλό",
  "Consent": "Συγκατάθεση",
  "Agree to terms": "Συμφωνείτε με τους όρους",
  "Creating keys": "Δημιουργία κλειδιών",
  "Ensure to save": "Βεβαιωθείτε ότι έχετε αποθηκεύσει",
  "Deployment": "Ανάπτυξη",
  "On blockchain": "Σε blockchain",
  "Print": "Τυπώνω",
  "Save as file": "Αποθήκευση ως αρχείο",
  "Send on email": "Αποστολή στο email",
  "Your seed phrase": "Τη φράση των σπόρων σας",
  "Deploy wallet on blockchain": "Ανυψώστε το πορτοφόλι στο blockchain",
  "I have saved in strong place": "Έχω σώσει σε ισχυρό μέρος",
  "Deployment process": "Διαδικασία ανάπτυξης",
  "Awaiting the transaction from the giver": "Περιμένοντας τη συναλλαγή από τον δωρητή",
  "Loading": "Φόρτωση",
  "Network": "Δίκτυο",
  "Deploy": "Παρατάσσω",
  "Deploy wallet instructions": "Για τη χρήση του πορτοφολιού πρέπει να αναπτύξει την έξυπνη σύμβαση. Κοστίζει κάποιο ποσό που πρέπει να έχετε στη διεύθυνση αυτού του πορτοφολιού.",
  "Take from giver": "Πάρτε από τον Giviver",
  "Balance": "Ισορροπία",
  "Message expired. Contract was not executed on chain. Possible reason: Account has insufficient balance for the requested operation. Send some value to account balance": "Το μήνυμα έληξε. Η σύμβαση δεν εκτελέστηκε στην αλυσίδα. Πιθανός λόγος: Ο λογαριασμός δεν έχει επαρκή ισορροπία για την απαιτούμενη λειτουργία. Στείλτε κάποια αξία για το υπόλοιπο λογαριασμού",
  "Check balance": "Ελέγξτε το υπόλοιπο",
  "Access your wallet": "Αποκτήστε πρόσβαση στο πορτοφόλι σας",
  "Incorrect password": "Λάθος κωδικός",
  "Restore wallet": "Επαναφορά πορτοφολιού",
  "Fetch first block failed: Can not send http request: Failed to fetch": "Fetch Το πρώτο μπλοκ απέτυχε: δεν μπορεί να στείλει αίτημα HTTP σε αυτό το δίκτυο",
  "Finishing up": "Τελειώνω",
  "Done!": "Ολοκληρώθηκε!",
  "Backup wallet": "Backup πορτοφόλι",
  "Backup description": "Αυτή η διαδικασία θα σας επιτρέψει είτε να δημιουργήσετε ένα κρυπτογραφημένο keystore είτε να αποκρυπτογραφήσετε και να δείτε όλα τα μυστικά σας κλειδιά.",
  "Backup warning": "Κρατώντας τα αντίγραφα ασφαλείας είναι η ευθύνη σας.",
  "Create backup file": "Δημιουργία αρχείου αντιγράφων ασφαλείας",
  "View account keys": "Προβολή κλειδιών λογαριασμού",
  "Set password": "Ορίστε κωδικό",
  "Generate file": "Δημιουργία αρχείου",
  "Just a second": "Μισό λεπτό",
  "Download": "Κατεβάστε",
  "Keep it safe": "Κρατησε το ΑΣΦΑΛΕΣ",
  "Keystore security": "Για τις μέγιστες ανάγκες ασφαλείας για να αποθηκεύσετε σε έναν διαχειριστή κωδικού πρόσβασης, όπως",
  "Password hint (Optional)": "Συμβουλή κωδικού πρόσβασης (προαιρετικό)",
  "Create a password hint": "Δημιουργήστε μια υπόδειξη κωδικού πρόσβασης",
  "Create keystore": "Δημιουργία keystore",
  "Security": "Ασφάλεια",
  "Sign out & lock": "Αποσύνδεση & Κλείδωμα",
  "Sign out": "Αποσύνδεση",
  "Information": "Πληροφορίες",
  "About app": "Σχετικά με την εφαρμογή",
  "Give feedback": "Δίνω ανατροφοδότηση",
  "Help": "Βοήθεια",
  "Team is not responsible for lost or stolen passwords": "Η ομάδα δεν είναι υπεύθυνη για τους χαμένους ή κλεμμένους κωδικούς πρόσβασης",
  "Creating keystore": "Δημιουργία keystore",
  "Backup content": "Αυτό το αντίγραφο ασφαλείας περιέχει τους τρέχοντες λογαριασμούς στο πορτοφόλι σας. Θα χρειαστούν επόμενα αντίγραφα ασφαλείας όταν προστίθενται μελλοντικοί λογαριασμοί.",
  "Safe storage of your keystore and password are important to keeping your cryptocurrency safe.": "Η ασφαλής αποθήκευση του keystore και του κωδικού πρόσβασής σας είναι σημαντική για τη διατήρηση της ασφαλούς σας κρυπτογράφησης.",
  "To store backup safely we recommend to use": "Για να αποθηκεύσετε ασφαλή ασφαλή, συνιστούμε να χρησιμοποιήσετε",
  "Full export": "Πλήρης εξαγωγή",
  "If you want to save all contracts added on accounts, all transactions related with accounts, then tick the checkbox.": "Εάν θέλετε να αποθηκεύσετε όλες τις συμβάσεις που προστίθενται σε λογαριασμούς, όλες οι συναλλαγές που σχετίζονται με τους λογαριασμούς, στη συνέχεια, σημειώστε το πλαίσιο ελέγχου.",
  "Download file": "Λήψη αρχείου",
  "Home": "Σπίτι",
  "Decrypted account addresses": "Απορρίμματα διευθύνσεων λογαριασμού",
  "These are all the secret keys stored in your wallet": "Αυτά είναι όλα τα μυστικά κλειδιά που αποθηκεύονται στο πορτοφόλι σας",
  "Backup keys": "Πλήκτρα αντιγράφων ασφαλείας",
  "Back to home": "Πίσω στο σπίτι",
  "Wallet address": "Διεύθυνση πορτοφολιού",
  "Secret key": "Μυστικό κλειδί",
  "Public key": "Δημόσιο κλειδί",
  "Nickname": "Παρατσούκλι",
  "Address/Keys": "Διεύθυνση / κλειδιά",
  "Address": "Διεύθυνση",
  "Restoring accounts to your wallet is quick and easy": "Επαναφορά λογαριασμών στο πορτοφόλι σας είναι γρήγορη και εύκολη",
  "You have several ways to process this. Please prepare needed file and password.": "Έχετε αρκετούς τρόπους για να το επεξεργαστείτε. Προετοιμάστε το απαραίτητο αρχείο και τον κωδικό πρόσβασης.",
  "Restore from keystore": "Επαναφορά από το Keystore",
  "For keystore": "Για keystore",
  "Decide": "Αποφασίζω",
  "Select accounts": "Επιλέξτε Λογαριασμοί",
  "Return to wallet": "Επιστροφή στο πορτοφόλι",
  "Restore from keys": "Επαναφορά από τα κλειδιά",
  "Restore from seed phrase": "Επαναφορά από φράση σπόρων",
  "Restore accounts": "Επαναφορά λογαριασμών",
  "To restore your accounts, please upload the keystore file created during your backup.": "Για να επαναφέρετε τους λογαριασμούς σας, ανεβάστε το αρχείο keystore που δημιουργήθηκε κατά τη διάρκεια της δημιουργίας αντιγράφων ασφαλείας.",
  "Click here to choose a file": "Κάντε κλικ εδώ για να επιλέξετε ένα αρχείο",
  "or drag and drop your file below.": "ή σύρετε και αφήστε το αρχείο παρακάτω.",
  "Drop file here": "Αρχείο πτώσης εδώ",
  "Confirm keystore": "Επιβεβαιώστε το KeyStore",
  "Enter your keystore file password.": "Εισαγάγετε τον κωδικό πρόσβασης του αρχείου Keystore.",
  "last modified date": "Τελευταία τροποποιημένη ημερομηνία",
  "Password hint": "Κωδικός Κωδικός",
  "Checking keystore": "Έλεγχος του keystore",
  "Oops": "Oop",
  "This is not a valid keystore file.": "Αυτό δεν είναι ένα έγκυρο αρχείο keystore.",
  "All wallets": "Όλα τα πορτοφόλια",
  "Password confirmed": "Ο κωδικός πρόσβασης επιβεβαιώθηκε",
  "Almost there! Now let's select which accounts you'd like to restore": "Σχεδόν έτοιμο! Τώρα ας επιλέξουμε ποιοι λογαριασμοί θα θέλατε να επαναφέρετε",
  "Saving accounts to wallet": "Εξοικονόμηση λογαριασμών στο πορτοφόλι",
  "Accounts restored": "Λογαριασμοί που αποκαθίστανται",
  "You've added the following wallets succesfully! You may now perform transactions using these addresses.": "Έχετε προσθέσει με επιτυχία τα ακόλουθα πορτοφόλια! Μπορείτε τώρα να εκτελέσετε συναλλαγές χρησιμοποιώντας αυτές τις διευθύνσεις.",
  "Finish": "Φινίρισμα",
  "Existed": "Υπήρχε",
  "Added": "Προστέθηκε",
  "Restore wallet by keys": "Επαναφορά πορτοφολιού από τα κλειδιά",
  "Specify your keys.": "Καθορίστε τα κλειδιά σας.",
  "Add wallet": "Προσθέστε πορτοφόλι",
  "Restore wallet by seed phrase": "Επαναφορά πορτοφολιού με φράση σπόρων",
  "Specify your seed phrase.": "Καθορίστε τη φράση των σπόρων σας.",
  "Add": "Προσθήκη",
  "Buy": "Αγορά",
  "Giver": "Δότης",
  "Swap": "Ανταλαγή",
  "Assets": "Περιουσιακά στοιχεία",
  "Transactions": "Συναλλαγές",
  "Accounts": "Λογαριασμοί",
  "Edit nickname": "Επεξεργασία ψευδώνυμου",
  "View on explorer": "Προβολή στον εξερευνητή",
  "Delete account": "Διαγραφή λογαριασμού",
  "Send transaction": "Στείλτε συναλλαγή",
  "Edit account nickname": "Επεξεργασία ψευδώνυμου λογαριασμού",
  "This action will remove the account. If you have there any assets, please to do backup before confirmation.": "Αυτή η ενέργεια θα καταργήσει το λογαριασμό. Εάν έχετε κάποια περιουσιακά στοιχεία, παρακαλούμε να κάνετε αντίγραφα ασφαλείας πριν την επιβεβαίωση.",
  "Delete": "Διαγράφω",
  "You can't delete the only account": "Δεν μπορείτε να διαγράψετε το μόνο λογαριασμό",
  "Amount is received": "Λαμβάνεται ποσό",
  "Error": "Λάθος",
  "Success": "Επιτυχία",
  "The wallet has been deployed": "Το πορτοφόλι έχει αναπτυχθεί",
  "Contract execution was terminated with error: compute phase isn't succeeded, exit code: 51 (Constructor was already called). Contract cannot be redeployed. For more information about exit code check the contract source code or ask the contract developer": "Η εκτέλεση της σύμβασης τερματίστηκε με σφάλμα: η φάση υπολογισμού δεν είναι επιτυχής, ο κωδικός εξόδου: 51 (ο κατασκευαστής κλήθηκε ήδη). Η σύμβαση δεν μπορεί να αναδιαλυθεί. Για περισσότερες πληροφορίες σχετικά με τον κώδικα εξόδου Ελέγξτε τον πηγαίο κώδικα της σύμβασης ή ζητήστε από τον προγραμματιστή συμβολαίων",
  "Account does not exist. You need to transfer funds to this account first to have a positive balance and then deploy its code. Possible reason: Account does not exist. You need to transfer funds to this account first to have a positive balance and then deploy its code": "Ο λογαριασμός δεν υπάρχει. Πρέπει να μεταφέρετε πρώτα κεφάλαια σε αυτόν τον λογαριασμό για να έχετε μια θετική ισορροπία και στη συνέχεια να αναπτύξετε τον κώδικα του",
  "Amount": "Ποσό",
  "Message": "Μήνυμα",
  "Send": "Στείλετε",
  "Version": "Εκδοχή",
  "About text": "Αυτή είναι η εφαρμογή του ανοικτού κώδικα. Μπορείτε πάντα να αξιολογήσετε την ασφάλειά του, αναλύοντας τον κώδικα στο github. Εάν έχετε επιθυμίες και προτάσεις, χρησιμοποιήστε το στοιχείο μενού ανατροφοδότησης για να επικοινωνήσετε μαζί μας.",
  "Visit website": "Επισκέψου την ιστοσελίδα",
  "Try TON blockchain web-extension": "Δοκιμάστε δωρεάν την επέκταση Blockchain Ton",
  "Add new network": "Προσθέστε νέο δίκτυο",
  "Specify your settings.": "Καθορίστε τις ρυθμίσεις σας.",
  "Name": "Ονομα",
  "Server": "Υπηρέτης",
  "Explorer": "Εξερευνητής",
  "Test network": "Δίκτυο δοκιμών",
  "Giver on test network": "Δίκτυο δοκιμών",
  "Coin name": "Όνομα κέρματος",
  "Wallet": "Πορτοφόλι",
  "Autologout (in minutes)": "Autologout (σε λεπτά)",
  "Open page": "Ανοικτή σελίδα",
  "Skip this step": "Παραλείψτε αυτό το βήμα",
  "Dismiss backup warning": "Απορρίψτε την προειδοποίηση αντιγράφων ασφαλείας",
  "Max": "Μέγιστη",
  "Account has insufficient balance for the requested operation. Send some value to account balance": "Ο λογαριασμός δεν έχει επαρκή ισορροπία για την απαιτούμενη λειτουργία. Στείλτε κάποια αξία για το υπόλοιπο λογαριασμού (> 0.02)",
  "Contract execution was terminated with error: compute phase isn't succeeded, exit code: 107. For more information about exit code check the contract source code or ask the contract developer": "Η εκτέλεση της σύμβασης τερματίστηκε με σφάλμα: η υπολογιστική φάση δεν επιτυγχάνεται, εξόδου Κωδικός: 107. Για περισσότερες πληροφορίες σχετικά με τον κωδικό εξόδου Ελέγξτε τον πηγαίο κώδικα της σύμβασης ή ζητήστε από τον προγραμματιστή συμβολαίου",
  "Warning": "Προειδοποίηση",
  "Warning text about restoring": "Η ανάκτηση φράσης σπόρων είναι μια ξεπερασμένη μέθοδος. Υποστηρίζουμε μόνο το Keystore αποκαθιστά στην πρώτη εκκίνηση. Μετά τη δημιουργία του πρώτου πορτοφολιού, θα είναι δυνατή η εξαγωγή του παλιού πορτοφολιού από τη φράση σπόρων.",
  "No matches": "Δεν υπάρχουν αγώνες",
  "Select or enter a new one": "Επιλέξτε ή εισάγετε ένα νέο",
  "Own addresses": "Δικές του διευθύνσεις",
  "Retrieving transactions period (in minutes)": "Ανάκτηση της περιόδου συναλλαγών (σε λεπτά)",
  "Fee": "Τέλη",
  "Total": "Σύνολο",
  "Destination": "Προορισμός",
  "Enter your pin code": "Εισαγάγετε τον κωδικό PIN",
  "Pin code (4-8 numbers)": "Κωδικός PIN (4-8 αριθμούς)",
  "Pin code contains 4-8 numbers. After 1 failed attempt it will be dropped. Login will be carried out through the password entry form. Pin code can be set up again on the settings page.": "Ο κωδικός PIN περιέχει 4-8 αριθμούς. Μετά από 1 αποτυχημένη προσπάθεια θα πέσει. Η σύνδεση θα πραγματοποιηθεί μέσω της φόρμας εισόδου κωδικού πρόσβασης. Ο κωδικός PIN μπορεί να ρυθμιστεί ξανά στη σελίδα Ρυθμίσεις.",
  "Clear": "Σαφή",
  "Incorrect pin code": "Εσφαλμένος κωδικός PIN",
  "Submit": "υποβάλλουν",
  "Select permissions that you will grant to this web domain": "Επιλέξτε Δικαιώματα που θα χορηγήσετε σε αυτόν τον τομέα ιστού",
  "Origin": "Προέλευση",
  "Grant": "Χορήγηση",
  "Web page will be able to know the provider state": "Η ιστοσελίδα θα είναι σε θέση να γνωρίζει την κατάσταση του παρόχου",
  "Method to get permissions granted by user": "Μέθοδος για να λάβετε δικαιώματα που χορηγούνται από τον χρήστη",
  "Method to request needed permissions from user": "Μέθοδος για την αίτηση απαιτούμενων δικαιωμάτων από τον χρήστη",
  "Web page will be able to know the selected account": "Η ιστοσελίδα θα είναι σε θέση να γνωρίζει τον επιλεγμένο λογαριασμό",
  "Web page will be able to know the selected endpoint": "Η ιστοσελίδα θα είναι σε θέση να γνωρίζει το επιλεγμένο τελικό σημείο",
  "Web page will be able to initialize the transaction dialog": "Η ιστοσελίδα θα είναι σε θέση να αρχίσει το παράθυρο διαλόγου συναλλαγής",
  "Web page will be able to subscribe on blockchain events": "Η ιστοσελίδα θα είναι σε θέση να εγγραφεί σε εκδηλώσεις blockchain",
  "Web page will be able to initialize the signing message dialog": "Η ιστοσελίδα θα είναι σε θέση να αρχίσει το παράθυρο διαλόγου σήματος υπογραφής",
  "Web page will be able to initialize the encrypting message dialog": "Η ιστοσελίδα θα είναι σε θέση να αρχίσει το παράθυρο διαλόγου κρυπτογράφησης",
  "Web page will be able to initialize the decrypting message dialog": "Η ιστοσελίδα θα είναι σε θέση να αρχίσει το παράθυρο διαλόγου αποκρυπτογράφησης",
  "Web page will be able to run generate_random_bytes method from crypto module": "Η ιστοσελίδα θα είναι σε θέση να τρέξει τη μέθοδο Generate_random_bytes από την Module Crypto",
  "Web page will be able to initialize the dialog for obtaining user signature": "Η ιστοσελίδα θα είναι σε θέση να αρχίσει το παράθυρο διαλόγου για την απόκτηση υπογραφής χρήστη",
  "Web page will be able to unsubscribe on blockchain events": "Η ιστοσελίδα θα μπορεί να απεγγραφεί σε εκδηλώσεις blockchain",
  "Method uses private keys": "Η μέθοδος χρησιμοποιεί ιδιωτικά κλειδιά",
  "Web page requests invalid permissions": "Η ιστοσελίδα ζητά μη έγκυρα δικαιώματα",
  "Please, confirm this signing only if you trust this web-page": "Παρακαλώ, επιβεβαιώστε αυτή την υπογραφή μόνο εάν εμπιστεύεστε αυτήν την ιστοσελίδα",
  "Web page will be able to obtain the public key for ton_encryptMessage method": "Η ιστοσελίδα θα είναι σε θέση να αποκτήσει το δημόσιο κλειδί για τη μέθοδο ton_encryptMessage",
  "Please, confirm this encryption process only if you trust this web-page": "Παρακαλώ, επιβεβαιώστε αυτή τη διαδικασία κρυπτογράφησης μόνο εάν εμπιστεύεστε αυτήν την ιστοσελίδα",
  "Please, confirm this decryption process only if you trust this web-page": "Παρακαλώ, επιβεβαιώστε αυτή τη διαδικασία αποκρυπτογράφησης μόνο εάν εμπιστεύεστε αυτήν την ιστοσελίδα",
  "Encrypt": "Κρυπτογραφώ",
  "Decrypt": "Αποκρυπτογραφώ",
  "Send to this web-page": "Αποστολή σε αυτήν την ιστοσελίδα",
  "Disclose": "Αποκαλύπτω",
  "Sign": "Σημάδι",
  "Please, provide information about your current account (address and public key) only if you trust this web-page": "Παρακαλείστε να παρέχετε πληροφορίες σχετικά με τον τρέχοντα λογαριασμό σας (διεύθυνση και το δημόσιο κλειδί) μόνο εάν εμπιστεύεστε αυτήν την ιστοσελίδα",
  "Please, provide information about your current endpoint only if you trust this web-page": "Παρακαλείστε να παρέχετε πληροφορίες σχετικά με το τρέχον τελικό σημείο μόνο εάν εμπιστεύεστε αυτήν την ιστοσελίδα",
  "Please, provide information about your nacl public key only if you trust this web-page": "Παρακαλείστε να παρέχετε πληροφορίες σχετικά με το δημόσιο κλειδί NACL μόνο εάν εμπιστεύεστε αυτήν την ιστοσελίδα",
  "Provide": "Προμηθεύω",
  "incoming": "εισερχόμενος",
  "transfer": "μετάφραση",
  "deploy": "παρατάσσω",
  "error": "λάθος",
  "Amount can't be less than 0,001": "Το ποσό δεν μπορεί να είναι μικρότερο από 0,001",
  "Amount can't be more than you have": "Το ποσό δεν μπορεί να είναι μεγαλύτερο από αυτό που έχετε",
  "Native": "Ντόπιος",
  "Import token": "Εισαγωγή διακριτικού",
  "Import": "Εισαγωγή",
  "Symbol": "Σύμβολο",
  "Icon": "Εικόνισμα",
  "Type": "Τύπος",
  "Decimals of precision": "Διπλάσια ακρίβεια",
  "tokenIncoming": "εισερχόμενος",
  "tokenTransfer": "μετάφραση",
  "Delete selected networks": "Διαγράψτε τα επιλεγμένα δίκτυα",
  "Delete selected assets": "Διαγράψτε τα επιλεγμένα στοιχεία ενεργητικού",
  "Manage networks": "Διαχειριστείτε δίκτυα",
  "Manage tokens": "Διαχειριστείτε τα μάρκες",
  "Tokens": "Μάρκες",
  "Networks": "Δίκτυα",
  "No tokens that you can remove": "Δεν υπάρχουν μάρκες που μπορείτε να αφαιρέσετε",
  "No networks that you can remove": "Δεν υπάρχουν δίκτυα που μπορείτε να καταργήσετε",
  "Enable TON proxy": "Ενεργοποίηση πληρεξούσιου τόνου",
  "Send raw transaction": "Αποστολή πρώτης συναλλαγής",
  "State init": "Κρατική init",
  "Currency to display asset cost": "Νόμισμα για την εμφάνιση του κόστους περιουσιακών στοιχείων",
  "QR code": "QR κώδικας",
  "Send the link": "Στείλτε τον σύνδεσμο",
  "Close": "Κλείσε",
  "Copy": "αντίγραφο",
  "Send from XTON wallet": "Αποστολή από το πορτοφόλι XTON",
  "Empty list": "Κενή λίστα",
  "Waiting for the transaction confirmation on the blockchain": "Περιμένοντας την επιβεβαίωση συναλλαγής στο blockchain",
  "Update transactions list": "Ενημέρωση της λίστας συναλλαγών",
  "Item index": "Ευρετήριο αντικειμένου",
  "Description": "Περιγραφή",
  "External link": "Εξωτερικός σύνδεσμος",
  "NFT content": "Περιεχόμενο NFT",
  "Owner": "Ιδιοκτήτης",
  "Privacy policy": "Πολιτική απορρήτου",
  "Terms of use": "Οροι χρήσης",
  "Data": "Δεδομένα",
  "Data type": "Τύπος δεδομένων",
  "Don't ask me when reconnecting": "Μην με ρωτάς όταν επανασυνδέσεις",
  "Dapp permissions": "Δικαιώματα DAPP",
  "Manage Dapp permissions": "Διαχείριση δικαιωμάτων DAPP",
  "Delete selected permissions": "Διαγραφή επιλεγμένων δικαιωμάτων",
  "No permissions that you can remove": "Χωρίς δικαιώματα που μπορείτε να καταργήσετε",
  "Web page will be able to initialize the raw transaction dialog": "Η ιστοσελίδα θα είναι σε θέση να αρχικοποιήσει το παράθυρο διαλόγου Raw Transaction",
  "Web page will be able to connect by TON connect protocol": "Η ιστοσελίδα θα είναι σε θέση να συνδεθεί με το Ton Connect Protocol",
  "Web page will be able to reconnect by TON connect protocol": "Η ιστοσελίδα θα είναι σε θέση να επανασυνδεθεί με πρωτόκολλο Ton Connect",
  "Search by domain": "Αναζήτηση ανά τομέα",
  "This transaction is expired": "Αυτή η συναλλαγή έχει λήξει",
  "This transaction is for another account": "Αυτή η συναλλαγή είναι για έναν άλλο λογαριασμό",
  "This transaction is for another network": "Αυτή η συναλλαγή είναι για ένα άλλο δίκτυο",
  "Extended mode": "Εκτεταμένη λειτουργία"
}
