{
  "am": "አማርኛ",
  "ar": "عربى",
  "bg": "български",
  "bn": "বাংলা",
  "ca": "Català",
  "cs": "čeština",
  "da": "dansk",
  "de": "Deutsche",
  "el": "Ελληνικά",
  "en": "English",
  "es": "Español",
  "et": "Eestlane",
  "fa": "فارسی",
  "fi": "Suomalainen",
  "fil": "Pilipino",
  "fr": "français",
  "gu": "ગુજરાતી",
  "he": "עִברִית",
  "hi": "हिंदी",
  "hr": "Hrvatski",
  "hu": "Magyar",
  "id": "Bahasa Indonesia",
  "it": "Italiano",
  "ja": "日本語",
  "kn": "ಕನ್ನಡ",
  "ko": "한국어",
  "lt": "Lietuvis",
  "lv": "Latvietis",
  "ml": "മലയാളം",
  "mr": "मराठी",
  "ms": "Bahasa Melayu",
  "nl": "Nederlandse",
  "no": "norsk",
  "pl": "Polskie",
  "pt_BR": "Portugues (brasil)",
  "pt_PT": "Portugues (Portugal)",
  "ro": "Română",
  "ru": "Русский",
  "sk": "Slovák",
  "sl": "Slovenščina",
  "sr": "Српски",
  "sv": "svenska",
  "sw": "Kiswahili",
  "ta": "தமிழ்",
  "te": "తెలుగు",
  "th": "ไทย",
  "tr": "Türk",
  "uk": "Український",
  "vi": "Tiếng Việt",
  "zh_CN": "中文（中国）",
  "zh_TW": "中文（台灣）",
  "...": "Naglo-load",
  "Settings": "Mga setting",
  "Save": "Iligtas",
  "Language": "Wika",
  "Save settings": "I-save ang mga setting",
  "You can adjust all by your preference": "Maaari mong ayusin ang lahat ayon sa iyong kagustuhan",
  "Cancel": "Kanselahin",
  "Confirm": "Kumpirmahin",
  "Are you sure?": "Sigurado ka ba?",
  "Create a password": "Gumawa ng password",
  "This password never changes so use a strong one that you'll remember. We recommend to use for storing": "Ang password na ito ay hindi kailanman nagbabago upang gamitin ang isang malakas na matatandaan mo. Inirerekomenda naming gamitin para sa pagtatago",
  "{charLength} or more characters": "{charLength} o higit pang mga character",
  "1 lowercase letter": "1 lowercase letter.",
  "1 capital letter": "1 capital letter.",
  "1 number": "1 numero",
  "1 special character": "1 espesyal na character.",
  "Save password": "I-save ang password",
  "At least 10 symbols": "Hindi bababa sa 10 simbolo.",
  "Confirm password": "Kumpirmahin ang password",
  "Password": "Password",
  "Keystore file confirmed": "Kinumpirma ang keystore file.",
  "Remember": "Tandaan",
  "TOS": "Ang pag-iimbak ng iyong password at pag-back up ng iyong wallet ay <strong> iyong responsibilidad </strong>. Mahalaga na mapanatiling ligtas ang iyong cryptocurrency.",
  "I understand": "naiintindihan ko",
  "go back": "bumalik ka",
  "Welcome!": "Maligayang pagdating!",
  "Creating a wallet is easy and secure. All accounts are encrypted locally in your browser, not on remote servers.": "Ang paglikha ng isang wallet ay madali at ligtas. Ang lahat ng mga account ay naka-encrypt nang lokal sa iyong browser, hindi sa mga remote server.",
  "Create a wallet": "Lumikha ng isang wallet",
  "Restore a wallet": "Ibalik ang isang wallet.",
  "Learn more about this wallet app": "Matuto nang higit pa tungkol sa Wallet App na ito",
  "Back": "Pabalik",
  "Wallet password": "Wallet Password.",
  "Upload": "Mag-upload",
  "Keystore file": "Keystore file.",
  "Unlock": "Unlock.",
  "Keystore password": "Keystore password",
  "Restore": "Ibalik",
  "Make your choice": "Gawin mo ang iyong pinili",
  "Complete": "Kumpleto",
  "Process end": "Proseso ng pagtatapos",
  "Make it good": "Gawin itong mabuti",
  "Consent": "Pahintulot",
  "Agree to terms": "Sumang-ayon sa mga tuntunin",
  "Creating keys": "Paglikha ng mga susi",
  "Ensure to save": "Tiyakin na i-save",
  "Deployment": "Pag-deploy",
  "On blockchain": "Sa Blockchain.",
  "Print": "Print.",
  "Save as file": "I-save bilang file.",
  "Send on email": "Ipadala sa email",
  "Your seed phrase": "Ang iyong bahagi ng binhi",
  "Deploy wallet on blockchain": "I-deploy ang Wallet sa Blockchain.",
  "I have saved in strong place": "Ako ay nai-save sa malakas na lugar",
  "Deployment process": "Proseso ng pag-deploy.",
  "Awaiting the transaction from the giver": "Naghihintay sa transaksyon mula sa Tagapagbigay.",
  "Loading": "Loading.",
  "Network": "Network.",
  "Deploy": "I-deploy",
  "Deploy wallet instructions": "Para sa paggamit ng wallet ay kailangang mag-deploy ng smart kontrata. Nagkakahalaga ito ng ilang halaga na dapat mong magkaroon sa address ng wallet na ito.",
  "Take from giver": "Kumuha mula sa tagabigay",
  "Balance": "Balanse",
  "Message expired. Contract was not executed on chain. Possible reason: Account has insufficient balance for the requested operation. Send some value to account balance": "Nag-expire ang mensahe. Ang kontrata ay hindi isinagawa sa kadena. Posibleng Dahilan: Ang account ay hindi sapat ang balanse para sa hiniling na operasyon. Magpadala ng halaga sa balanse ng account",
  "Check balance": "Suriin ang balanse",
  "Access your wallet": "I-access ang iyong wallet",
  "Incorrect password": "Maling password",
  "Restore wallet": "Ibalik ang Wallet.",
  "Fetch first block failed: Can not send http request: Failed to fetch": "Nabigo ang Fetch First Block: Hindi maaaring magpadala ng HTTP na kahilingan sa network na ito",
  "Finishing up": "Tinatapos ko na",
  "Done!": "Tapos na!",
  "Backup wallet": "Backup wallet.",
  "Backup description": "Ang prosesong ito ay magbibigay-daan sa iyo upang lumikha ng isang naka-encrypt na keystore o i-decrypt at tingnan ang iyong lahat ng iyong mga lihim na key.",
  "Backup warning": "Ang pagpapanatiling backup ay ang iyong responsibilidad.",
  "Create backup file": "Lumikha ng backup file.",
  "View account keys": "Tingnan ang mga key ng account",
  "Set password": "Itakda ang password",
  "Generate file": "Bumuo ng file",
  "Just a second": "Isang segundo",
  "Download": "I-download",
  "Keep it safe": "Panatilihing ligtas ito",
  "Keystore security": "Para sa maximum na seguridad ay kailangang mag-imbak sa isang tagapamahala ng password tulad ng",
  "Password hint (Optional)": "Pahiwatig ng Password (opsyonal)",
  "Create a password hint": "Lumikha ng isang pahiwatig ng password",
  "Create keystore": "Lumikha ng keystore",
  "Security": "Seguridad",
  "Sign out & lock": "Mag-sign Out & Lock.",
  "Sign out": "Mag-sign out",
  "Information": "Impormasyon",
  "About app": "Tungkol sa app.",
  "Give feedback": "Magbigay ng feedback.",
  "Help": "Tulong",
  "Team is not responsible for lost or stolen passwords": "Ang koponan ay hindi mananagot para sa nawala o ninakaw na mga password",
  "Creating keystore": "Paglikha ng keystore",
  "Backup content": "Ang backup na ito ay naglalaman ng mga kasalukuyang account sa iyong wallet. Kinakailangan ang mga kasunod na pag-backup kapag idinagdag ang mga hinaharap na account.",
  "Safe storage of your keystore and password are important to keeping your cryptocurrency safe.": "Ang ligtas na imbakan ng iyong keystore at password ay mahalaga upang mapanatiling ligtas ang iyong cryptocurrency.",
  "To store backup safely we recommend to use": "Upang ligtas na mag-imbak ng backup na inirerekomenda naming gamitin",
  "Full export": "Buong pag-export",
  "If you want to save all contracts added on accounts, all transactions related with accounts, then tick the checkbox.": "Kung nais mong i-save ang lahat ng mga kontrata na idinagdag sa mga account, ang lahat ng mga transaksyon na may kaugnayan sa mga account, pagkatapos ay lagyan ng tsek ang checkbox.",
  "Download file": "I-download ang file",
  "Home": "Bahay",
  "Decrypted account addresses": "Decrypted address address.",
  "These are all the secret keys stored in your wallet": "Ang mga ito ay ang lahat ng mga lihim na key na nakaimbak sa iyong wallet",
  "Backup keys": "Backup keys.",
  "Back to home": "Bumalik sa bahay",
  "Wallet address": "Address ng Wallet.",
  "Secret key": "Lihim na key",
  "Public key": "Pampublikong key",
  "Nickname": "Palayaw",
  "Address/Keys": "Address / Keys.",
  "Address": "Address.",
  "Restoring accounts to your wallet is quick and easy": "Ang pagpapanumbalik ng mga account sa iyong wallet ay mabilis at madali",
  "You have several ways to process this. Please prepare needed file and password.": "Mayroon kang maraming mga paraan upang maproseso ito. Mangyaring maghanda ng kinakailangang file at password.",
  "Restore from keystore": "Ibalik mula sa keystore",
  "For keystore": "Para sa keystore",
  "Decide": "Magpasya",
  "Select accounts": "Piliin ang Mga Account",
  "Return to wallet": "Bumalik sa wallet.",
  "Restore from keys": "Ibalik mula sa mga susi",
  "Restore from seed phrase": "Ibalik mula sa binhi parirala",
  "Restore accounts": "Ibalik ang mga account",
  "To restore your accounts, please upload the keystore file created during your backup.": "Upang ibalik ang iyong mga account, mangyaring i-upload ang keystore file na nilikha sa panahon ng iyong backup.",
  "Click here to choose a file": "Mag-click dito upang pumili ng isang file",
  "or drag and drop your file below.": "o i-drag at i-drop ang iyong file sa ibaba.",
  "Drop file here": "Drop file dito",
  "Confirm keystore": "Kumpirmahin ang keystore.",
  "Enter your keystore file password.": "Ipasok ang iyong keystore file password.",
  "last modified date": "Huling binagong petsa",
  "Password hint": "Pahiwatig ng Password",
  "Checking keystore": "Sinusuri ang keystore.",
  "Oops": "Oops.",
  "This is not a valid keystore file.": "Hindi ito isang wastong keystore file.",
  "All wallets": "Lahat ng mga wallet.",
  "Password confirmed": "Nakumpirma ang password",
  "Almost there! Now let's select which accounts you'd like to restore": "Malapit na! Ngayon piliin natin kung aling mga account ang gusto mong ibalik",
  "Saving accounts to wallet": "Pag-save ng mga account sa Wallet.",
  "Accounts restored": "Naibalik ang mga account",
  "You've added the following wallets succesfully! You may now perform transactions using these addresses.": "Nagdagdag ka nang matagumpay ang mga sumusunod na wallet! Maaari ka na ngayong magsagawa ng mga transaksyon gamit ang mga address na ito.",
  "Finish": "Tapos na",
  "Existed": "Umiiral",
  "Added": "Idinagdag.",
  "Restore wallet by keys": "Ibalik ang wallet sa pamamagitan ng mga key.",
  "Specify your keys.": "Tukuyin ang iyong mga susi.",
  "Add wallet": "Magdagdag ng wallet.",
  "Restore wallet by seed phrase": "Ibalik ang wallet sa pamamagitan ng binhi parirala",
  "Specify your seed phrase.": "Tukuyin ang iyong pariralang binhi.",
  "Add": "Idagdag",
  "Buy": "Buy.",
  "Giver": "Tagapagbigay.",
  "Swap": "Swap.",
  "Assets": "Mga Asset.",
  "Transactions": "Transaksyon",
  "Accounts": "Mga account.",
  "Edit nickname": "I-edit ang palayaw.",
  "View on explorer": "Tingnan sa Explorer.",
  "Delete account": "Tanggalin ang account",
  "Send transaction": "Magpadala ng transaksyon",
  "Edit account nickname": "I-edit ang palayaw ng account.",
  "This action will remove the account. If you have there any assets, please to do backup before confirmation.": "Aalisin ng pagkilos na ito ang account. Kung mayroon kang anumang mga asset, mangyaring gawin ang backup bago kumpirmasyon.",
  "Delete": "Tanggalin.",
  "You can't delete the only account": "Hindi mo maaaring tanggalin ang tanging account.",
  "Amount is received": "Natanggap ang halaga",
  "Error": "ERROR.",
  "Success": "Tagumpay",
  "The wallet has been deployed": "Ang wallet ay na-deploy",
  "Contract execution was terminated with error: compute phase isn't succeeded, exit code: 51 (Constructor was already called). Contract cannot be redeployed. For more information about exit code check the contract source code or ask the contract developer": "Ang pagpapatupad ng kontrata ay tinapos na may error: compute phase ay hindi nagtagumpay, exit code: 51 (Constructor ay tinatawag na). Ang kontrata ay hindi maaaring i-redeploy. Para sa karagdagang impormasyon tungkol sa exit code suriin ang contract source code o tanungin ang developer ng kontrata",
  "Account does not exist. You need to transfer funds to this account first to have a positive balance and then deploy its code. Possible reason: Account does not exist. You need to transfer funds to this account first to have a positive balance and then deploy its code": "Hindi umiiral ang account. Kailangan mong maglipat ng mga pondo sa account na ito muna upang magkaroon ng isang positibong balanse at pagkatapos ay i-deploy ang code nito",
  "Amount": "Halaga",
  "Message": "Mensahe.",
  "Send": "Magpadala",
  "Version": "Bersyon",
  "About text": "Ito ang open source code application. Maaari mong palaging masuri ang kaligtasan nito sa pamamagitan ng pag-aaral ng code sa GitHub. Kung mayroon kang anumang mga hangarin at suhestiyon, mangyaring gamitin ang item ng menu ng feedback upang makipag-ugnay sa amin.",
  "Visit website": "Bisitahin ang Website",
  "Try TON blockchain web-extension": "Subukan ang libreng toneladang blockchain web-extension",
  "Add new network": "Magdagdag ng bagong network",
  "Specify your settings.": "Tukuyin ang iyong mga setting.",
  "Name": "Pangalan",
  "Server": "Server",
  "Explorer": "Explorer.",
  "Test network": "Test Network.",
  "Giver on test network": "Giver sa Test Network.",
  "Coin name": "Pangalan ng barya",
  "Wallet": "Wallet",
  "Autologout (in minutes)": "Autologout (sa ilang minuto)",
  "Open page": "Buksan ang pahina",
  "Skip this step": "Laktawan ang hakbang na ito",
  "Dismiss backup warning": "I-dismiss ang Backup Warning.",
  "Max": "Max.",
  "Account has insufficient balance for the requested operation. Send some value to account balance": "Hindi sapat ang balanse ng account para sa hiniling na operasyon. Magpadala ng ilang halaga sa balanse sa account (> 0.02)",
  "Contract execution was terminated with error: compute phase isn't succeeded, exit code: 107. For more information about exit code check the contract source code or ask the contract developer": "Ang pagpapatupad ng kontrata ay tinapos na may error: compute phase ay hindi nagtagumpay, exit code: 107. Para sa karagdagang impormasyon tungkol sa exit code suriin ang contract source code o magtanong sa developer ng kontrata",
  "Warning": "Babala",
  "Warning text about restoring": "Ang pagbawi ng parirala ng binhi ay isang hindi napapanahong paraan. Sinusuportahan lamang namin ang keystore restores sa unang paglunsad. Pagkatapos ng paglikha ng unang wallet, posible na i-export ang lumang wallet mula sa pariralang binhi.",
  "No matches": "Walang mga tugma",
  "Select or enter a new one": "Piliin o ipasok ang isang bago",
  "Own addresses": "Sariling address.",
  "Retrieving transactions period (in minutes)": "Pagkuha ng panahon ng transaksyon (sa ilang minuto)",
  "Fee": "Fee.",
  "Total": "Kabuuan",
  "Destination": "Patutunguhan",
  "Enter your pin code": "Ipasok ang iyong PIN code",
  "Pin code (4-8 numbers)": "PIN code (4-8 na numero)",
  "Pin code contains 4-8 numbers. After 1 failed attempt it will be dropped. Login will be carried out through the password entry form. Pin code can be set up again on the settings page.": "Ang PIN code ay naglalaman ng 4-8 na numero. Pagkatapos ng 1 nabigo pagtatangka ito ay bumaba. Isinasagawa ang pag-login sa pamamagitan ng form ng entry ng password. Maaaring i-set up muli ang PIN code sa pahina ng mga setting.",
  "Clear": "Malinaw",
  "Incorrect pin code": "Maling PIN code",
  "Submit": "Ipasa",
  "Select permissions that you will grant to this web domain": "Piliin ang Mga Pahintulot na ibibigay mo sa web domain na ito",
  "Origin": "Pinagmulan",
  "Grant": "Bigyan",
  "Web page will be able to know the provider state": "Maaaring malaman ng web page ang estado ng provider",
  "Method to get permissions granted by user": "Paraan upang makakuha ng mga pahintulot na ipinagkaloob ng user",
  "Method to request needed permissions from user": "Paraan upang humiling ng mga kinakailangang pahintulot mula sa user",
  "Web page will be able to know the selected account": "Maaaring malaman ng web page ang napiling account",
  "Web page will be able to know the selected endpoint": "Maaaring malaman ng web page ang napiling endpoint",
  "Web page will be able to initialize the transaction dialog": "Magagawa ng web page ang dialog ng transaksyon",
  "Web page will be able to subscribe on blockchain events": "Maaaring mag-subscribe ang web page sa mga kaganapan sa Blockchain",
  "Web page will be able to initialize the signing message dialog": "Magagawa ng web page ang dialog ng mensahe ng pag-sign",
  "Web page will be able to initialize the encrypting message dialog": "Magagawa ng web page ang pag-encrypt ng dialog ng mensahe",
  "Web page will be able to initialize the decrypting message dialog": "Magagawa ng web page ang dialog ng decrypting message",
  "Web page will be able to run generate_random_bytes method from crypto module": "Maaaring patakbuhin ang web page ng Generate_random_Bytes mula sa Crypto Module",
  "Web page will be able to initialize the dialog for obtaining user signature": "Ang web page ay magagawang simulan ang dialog para sa pagkuha ng lagda ng gumagamit",
  "Web page will be able to unsubscribe on blockchain events": "Ang web page ay makakapag-unsubscribe sa mga kaganapan sa blockchain",
  "Method uses private keys": "Ang pamamaraan ay gumagamit ng mga pribadong key",
  "Web page requests invalid permissions": "Mga kahilingan sa web page Mga di-wastong pahintulot",
  "Please, confirm this signing only if you trust this web-page": "Mangyaring kumpirmahin ang pag-sign lang kung pinagkakatiwalaan mo ang web-page na ito",
  "Web page will be able to obtain the public key for ton_encryptMessage method": "Maaaring makuha ng web page ang pampublikong key para sa ton_encryptMessage method",
  "Please, confirm this encryption process only if you trust this web-page": "Mangyaring kumpirmahin lamang ang proseso ng pag-encrypt na ito kung pinagkakatiwalaan mo ang web-page na ito",
  "Please, confirm this decryption process only if you trust this web-page": "Mangyaring kumpirmahin lamang ang proseso ng pag-decryption na ito kung pinagkakatiwalaan mo ang web-page na ito",
  "Encrypt": "Encrypt",
  "Decrypt": "Decrypt.",
  "Send to this web-page": "Ipadala sa web-page na ito",
  "Disclose": "Ibunyag",
  "Sign": "Tanda",
  "Please, provide information about your current account (address and public key) only if you trust this web-page": "Mangyaring magbigay ng impormasyon tungkol sa iyong kasalukuyang account (address at pampublikong key) kung pinagkakatiwalaan mo ang web-page na ito",
  "Please, provide information about your current endpoint only if you trust this web-page": "Mangyaring magbigay ng impormasyon tungkol sa iyong kasalukuyang endpoint lamang kung pinagkakatiwalaan mo ang web-page na ito",
  "Please, provide information about your nacl public key only if you trust this web-page": "Mangyaring magbigay ng impormasyon tungkol sa iyong Public key ng NACL lamang kung pinagkakatiwalaan mo ang web-page na ito",
  "Provide": "Magbigay",
  "incoming": "Papasok",
  "transfer": "paglipat",
  "deploy": "I-deploy",
  "error": "ERROR.",
  "Amount can't be less than 0,001": "Ang halaga ay hindi maaaring mas mababa sa 0,001.",
  "Amount can't be more than you have": "Ang halaga ay hindi maaaring higit pa sa mayroon ka",
  "Native": "Katutubo",
  "Import token": "Mag-import ng token",
  "Import": "Angkat",
  "Symbol": "Simbolo",
  "Icon": "Icon",
  "Type": "Type.",
  "Decimals of precision": "Decimals ng katumpakan",
  "tokenIncoming": "Papasok",
  "tokenTransfer": "paglipat",
  "Delete selected networks": "Tanggalin ang mga napiling network",
  "Delete selected assets": "Tanggalin ang mga napiling asset.",
  "Manage networks": "Pamahalaan ang mga network",
  "Manage tokens": "Pamahalaan ang mga token.",
  "Tokens": "Mga token.",
  "Networks": "Mga network",
  "No tokens that you can remove": "Walang mga token na maaari mong alisin",
  "No networks that you can remove": "Walang mga network na maaari mong alisin",
  "Enable TON proxy": "Paganahin ang tonong proxy",
  "Send raw transaction": "Magpadala ng hilaw na transaksyon",
  "State init": "State init",
  "Currency to display asset cost": "Pera upang ipakita ang gastos sa asset",
  "QR code": "QR Code",
  "Send the link": "Ipadala ang link",
  "Close": "Malapit",
  "Copy": "Kopya",
  "Send from XTON wallet": "Magpadala mula sa Xton Wallet",
  "Empty list": "Walang laman na listahan",
  "Waiting for the transaction confirmation on the blockchain": "Naghihintay para sa kumpirmasyon ng transaksyon sa blockchain",
  "Update transactions list": "I-update ang listahan ng mga transaksyon",
  "Item index": "Index ng item",
  "Description": "Paglalarawan",
  "External link": "Panlabas na link",
  "NFT content": "Nilalaman ng NFT",
  "Owner": "May -ari",
  "Privacy policy": "Patakaran sa Pagkapribado",
  "Terms of use": "Mga Tuntunin ng Paggamit",
  "Data": "Data",
  "Data type": "Uri ng datos",
  "Don't ask me when reconnecting": "Huwag mo akong tanungin kung kailan muling kumonekta",
  "Dapp permissions": "Mga pahintulot ng DAPP",
  "Manage Dapp permissions": "Pamahalaan ang mga pahintulot sa DAPP",
  "Delete selected permissions": "Tanggalin ang mga napiling pahintulot",
  "No permissions that you can remove": "Walang mga pahintulot na maaari mong alisin",
  "Web page will be able to initialize the raw transaction dialog": "Ang web page ay magagawang simulan ang dialog ng Raw Transaksyon",
  "Web page will be able to connect by TON connect protocol": "Ang web page ay maaaring kumonekta sa pamamagitan ng ton connect protocol",
  "Web page will be able to reconnect by TON connect protocol": "Ang web page ay magagawang muling kumonekta sa pamamagitan ng ton connect protocol",
  "Search by domain": "Maghanap sa pamamagitan ng domain",
  "This transaction is expired": "Ang transaksyon na ito ay nag -expire",
  "This transaction is for another account": "Ang transaksyon na ito ay para sa isa pang account",
  "This transaction is for another network": "Ang transaksyon na ito ay para sa isa pang network",
  "Extended mode": "Pinalawig na mode"
}
