{
  "am": "አማርኛ",
  "ar": "عربى",
  "bg": "български",
  "bn": "বাংলা",
  "ca": "Català",
  "cs": "čeština",
  "da": "dansk",
  "de": "Deutsche",
  "el": "Ελληνικά",
  "en": "English",
  "es": "Español",
  "et": "Eestlane",
  "fa": "فارسی",
  "fi": "Suomalainen",
  "fil": "Pilipino",
  "fr": "français",
  "gu": "ગુજરાતી",
  "he": "עִברִית",
  "hi": "हिंदी",
  "hr": "Hrvatski",
  "hu": "Magyar",
  "id": "Bahasa Indonesia",
  "it": "Italiano",
  "ja": "日本語",
  "kn": "ಕನ್ನಡ",
  "ko": "한국어",
  "lt": "Lietuvis",
  "lv": "Latvietis",
  "ml": "മലയാളം",
  "mr": "मराठी",
  "ms": "Bahasa Melayu",
  "nl": "Nederlandse",
  "no": "norsk",
  "pl": "Polskie",
  "pt_BR": "Portugues (brasil)",
  "pt_PT": "Portugues (Portugal)",
  "ro": "Română",
  "ru": "Русский",
  "sk": "Slovák",
  "sl": "Slovenščina",
  "sr": "Српски",
  "sv": "svenska",
  "sw": "Kiswahili",
  "ta": "தமிழ்",
  "te": "తెలుగు",
  "th": "ไทย",
  "tr": "Türk",
  "uk": "Український",
  "vi": "Tiếng Việt",
  "zh_CN": "中文（中国）",
  "zh_TW": "中文（台灣）",
  "...": "Chargement",
  "Settings": "Paramètres",
  "Save": "Sauvegarder",
  "Language": "Langue",
  "Save settings": "Enregistrer les paramètres",
  "You can adjust all by your preference": "Vous pouvez ajuster tout par votre préférence",
  "Cancel": "Annuler",
  "Confirm": "Confirmer",
  "Are you sure?": "Êtes-vous sûr?",
  "Create a password": "Créer un mot de passe",
  "This password never changes so use a strong one that you'll remember. We recommend to use for storing": "Ce mot de passe ne change jamais, alors utilisez un fort que vous vous souviendrez. Nous vous recommandons d'utiliser pour stocker",
  "{charLength} or more characters": "{charLength} ou plus de caractères",
  "1 lowercase letter": "1 lettre minuscule",
  "1 capital letter": "1 lettre majuscule",
  "1 number": "1 numéro",
  "1 special character": "1 caractère spécial",
  "Save password": "Enregistrer le mot de passe",
  "At least 10 symbols": "Au moins 10 symboles",
  "Confirm password": "Confirmez le mot de passe",
  "Password": "Mot de passe",
  "Keystore file confirmed": "Fichier KeyStore confirmé",
  "Remember": "Rappelles toi",
  "TOS": "Stocker votre mot de passe et sauvegarder votre portefeuille est <strong> votre responsabilité </strong>. Ceci est important de garder votre sécurité de cryptocurrence.",
  "I understand": "je comprends",
  "go back": "retourner",
  "Welcome!": "Bienvenue!",
  "Creating a wallet is easy and secure. All accounts are encrypted locally in your browser, not on remote servers.": "Créer un portefeuille est facile et sécurisé. Tous les comptes sont cryptés localement dans votre navigateur et non sur des serveurs distants.",
  "Create a wallet": "Créer un portefeuille",
  "Restore a wallet": "Restaurer un portefeuille",
  "Learn more about this wallet app": "En savoir plus sur cette application Wallet",
  "Back": "Dos",
  "Wallet password": "Mot de passe de portefeuille",
  "Upload": "Télécharger",
  "Keystore file": "Fichier de clés",
  "Unlock": "Ouvrir",
  "Keystore password": "Mot de passe mot de passe",
  "Restore": "Restaurer",
  "Make your choice": "Fais ton choix",
  "Complete": "Compléter",
  "Process end": "Fin de processus",
  "Make it good": "Fais le bien",
  "Consent": "Consentement",
  "Agree to terms": "Accepter les termes",
  "Creating keys": "Créer des clés",
  "Ensure to save": "Assurez-vous d'économiser",
  "Deployment": "Déploiement",
  "On blockchain": "Sur le blockchain",
  "Print": "Imprimer",
  "Save as file": "Enregistrer en tant que fichier",
  "Send on email": "Envoyer un email",
  "Your seed phrase": "Votre phrase de graine",
  "Deploy wallet on blockchain": "Déployez le portefeuille sur le blockchain",
  "I have saved in strong place": "J'ai sauvé dans un endroit fort",
  "Deployment process": "Processus de déploiement",
  "Awaiting the transaction from the giver": "En attente de la transaction du donneur",
  "Loading": "Chargement",
  "Network": "Réseau",
  "Deploy": "Déployer",
  "Deploy wallet instructions": "Pour utiliser le portefeuille doit déployer un contrat intelligent. Cela coûte une certaine quantité que vous devez avoir sur l'adresse de ce portefeuille.",
  "Take from giver": "Prendre du donneur",
  "Balance": "Équilibre",
  "Message expired. Contract was not executed on chain. Possible reason: Account has insufficient balance for the requested operation. Send some value to account balance": "Message expiré. Le contrat n'a pas été exécuté sur la chaîne. Raison possible: Le compte a insuffisant l'équilibre pour l'opération demandée. Envoyer une certaine valeur au solde du compte",
  "Check balance": "Vérifier l'équilibre",
  "Access your wallet": "Accédez à votre portefeuille",
  "Incorrect password": "Mot de passe incorrect",
  "Restore wallet": "Restaurer le portefeuille",
  "Fetch first block failed: Can not send http request: Failed to fetch": "Fetch First Block a échoué: Impossible d'envoyer une demande HTTP sur ce réseau",
  "Finishing up": "Finir",
  "Done!": "Fait!",
  "Backup wallet": "Portefeuille de sauvegarde",
  "Backup description": "Ce processus vous permettra de créer un keyStore crypté ou de déchiffrer et de consulter toutes vos clés secrètes.",
  "Backup warning": "Garder des sauvegardes en sécurité est votre responsabilité.",
  "Create backup file": "Créer un fichier de sauvegarde",
  "View account keys": "Voir les clés de compte",
  "Set password": "Définir le mot de passe",
  "Generate file": "Générer un fichier",
  "Just a second": "Juste une seconde",
  "Download": "Télécharger",
  "Keep it safe": "Protégez-le",
  "Keystore security": "Pour que la sécurité maximale doit stocker dans un gestionnaire de mots de passe telle que",
  "Password hint (Optional)": "Indication de mot de passe facultative)",
  "Create a password hint": "Créer un conseil de mot de passe",
  "Create keystore": "Créer des clés",
  "Security": "Sécurité",
  "Sign out & lock": "Déconnexion et verrouillage",
  "Sign out": "Déconnexion",
  "Information": "Informations",
  "About app": "À propos de l'application",
  "Give feedback": "Donner des commentaires",
  "Help": "Aider",
  "Team is not responsible for lost or stolen passwords": "L'équipe n'est pas responsable des mots de passe perdus ou volés",
  "Creating keystore": "Créer des clés",
  "Backup content": "Cette sauvegarde contient des comptes de courant dans votre portefeuille. Des sauvegardes ultérieures seront nécessaires lorsque des comptes futurs sont ajoutés.",
  "Safe storage of your keystore and password are important to keeping your cryptocurrency safe.": "Le stockage sûr de votre clé de clés et de votre mot de passe est important pour garder votre sécurité de cryptocurrence.",
  "To store backup safely we recommend to use": "Pour stocker la sauvegarde en toute sécurité, nous vous recommandons d'utiliser",
  "Full export": "Exportation complète",
  "If you want to save all contracts added on accounts, all transactions related with accounts, then tick the checkbox.": "Si vous souhaitez enregistrer tous les contrats ajoutés sur comptes, toutes les transactions relatives aux comptes, puis cochez la case.",
  "Download file": "Télécharger un fichier",
  "Home": "Domicile",
  "Decrypted account addresses": "Adresses de compte déchiffrés",
  "These are all the secret keys stored in your wallet": "Ce sont toutes les clés secrètes stockées dans votre portefeuille",
  "Backup keys": "Touches de sauvegarde",
  "Back to home": "De retour à la maison",
  "Wallet address": "Adresse du portefeuille",
  "Secret key": "Clef secrète",
  "Public key": "Clé publique",
  "Nickname": "Surnom",
  "Address/Keys": "Adresse / clés",
  "Address": "Adresse",
  "Restoring accounts to your wallet is quick and easy": "Restauration des comptes à votre portefeuille est rapide et facile",
  "You have several ways to process this. Please prepare needed file and password.": "Vous avez plusieurs façons de traiter cela. Veuillez préparer le fichier et le mot de passe nécessaires.",
  "Restore from keystore": "Restaurer de KeyStore",
  "For keystore": "Pour KeyStore",
  "Decide": "Décider",
  "Select accounts": "Sélectionnez Comptes",
  "Return to wallet": "Retourner au portefeuille",
  "Restore from keys": "Restaurer des clés",
  "Restore from seed phrase": "Restaurer de la phrase de la graine",
  "Restore accounts": "Restaurer des comptes",
  "To restore your accounts, please upload the keystore file created during your backup.": "Pour restaurer vos comptes, veuillez télécharger le fichier KeyStore créé lors de votre sauvegarde.",
  "Click here to choose a file": "Cliquez ici pour choisir un fichier",
  "or drag and drop your file below.": "ou faites glisser votre fichier ci-dessous.",
  "Drop file here": "Drop Fichier ici",
  "Confirm keystore": "Confirmer KeyStore",
  "Enter your keystore file password.": "Entrez votre mot de passe de fichier KeyStore.",
  "last modified date": "Date de dernière modification",
  "Password hint": "Question secrète de mot de passe",
  "Checking keystore": "Vérification du keyStore",
  "Oops": "Oops",
  "This is not a valid keystore file.": "Ce n'est pas un fichier KeyStore valide.",
  "All wallets": "Tous les portefeuilles",
  "Password confirmed": "Mot de passe confirmé",
  "Almost there! Now let's select which accounts you'd like to restore": "Presque là! Maintenant sélectionnons les comptes que vous souhaitez restaurer",
  "Saving accounts to wallet": "Économiser des comptes au portefeuille",
  "Accounts restored": "Comptes restaurés",
  "You've added the following wallets succesfully! You may now perform transactions using these addresses.": "Vous avez ajouté avec succès les portefeuilles suivants! Vous pouvez maintenant effectuer des transactions en utilisant ces adresses.",
  "Finish": "Finir",
  "Existed": "Existé",
  "Added": "Ajoutée",
  "Restore wallet by keys": "Restaurer le portefeuille de clés",
  "Specify your keys.": "Spécifiez vos clés.",
  "Add wallet": "Ajout de portefeuille",
  "Restore wallet by seed phrase": "Restaurer le portefeuille par phrase de graine",
  "Specify your seed phrase.": "Spécifiez votre phrase de graine.",
  "Add": "Ajouter",
  "Buy": "Acheter",
  "Giver": "Donneur",
  "Swap": "Échanger",
  "Assets": "Les atouts",
  "Transactions": "Transactions",
  "Accounts": "Comptes",
  "Edit nickname": "Editez surnom",
  "View on explorer": "Vue sur Explorer",
  "Delete account": "Supprimer le compte",
  "Send transaction": "Envoyer une transaction",
  "Edit account nickname": "Modifier le surnom de compte",
  "This action will remove the account. If you have there any assets, please to do backup before confirmation.": "Cette action supprimera le compte. Si vous avez des actifs, s'il vous plaît faire la sauvegarde avant la confirmation.",
  "Delete": "Effacer",
  "You can't delete the only account": "Vous ne pouvez pas supprimer le seul compte",
  "Amount is received": "Montant est reçu",
  "Error": "Erreur",
  "Success": "Succès",
  "The wallet has been deployed": "Le portefeuille a été déployé",
  "Contract execution was terminated with error: compute phase isn't succeeded, exit code: 51 (Constructor was already called). Contract cannot be redeployed. For more information about exit code check the contract source code or ask the contract developer": "L'exécution de contrat a été terminée avec erreur: la phase de calcul n'est pas réussi, la sortie Code: 51 (constructeur a déjà été appelé). Le contrat ne peut pas être redéployé. Pour plus d'informations sur le code de sortie, vérifiez le code source du contrat ou demander au développeur contractuel",
  "Account does not exist. You need to transfer funds to this account first to have a positive balance and then deploy its code. Possible reason: Account does not exist. You need to transfer funds to this account first to have a positive balance and then deploy its code": "Le compte n'existe pas. Vous devez d'abord transférer des fonds sur ce compte pour avoir un équilibre positif, puis déployer son code.",
  "Amount": "Montant",
  "Message": "Un message",
  "Send": "Envoyer",
  "Version": "Version",
  "About text": "Ceci est l'application de code open source. Vous pouvez toujours évaluer sa sécurité en analysant le code sur GitHub. Si vous avez des souhaits et des suggestions, veuillez utiliser l'élément de menu de retour pour nous contacter.",
  "Visit website": "Visiter le site web",
  "Try TON blockchain web-extension": "Essayez l'extension web de Ton Blockchain gratuit",
  "Add new network": "Ajouter un nouveau réseau",
  "Specify your settings.": "Spécifiez vos paramètres.",
  "Name": "Nom",
  "Server": "Serveur",
  "Explorer": "Explorateur",
  "Test network": "Réseau de test",
  "Giver on test network": "GOIVER sur le réseau de test",
  "Coin name": "Nom de la pièce",
  "Wallet": "Portefeuille",
  "Autologout (in minutes)": "Autologut (en minutes)",
  "Open page": "Page ouverte",
  "Skip this step": "Passer cette étape",
  "Dismiss backup warning": "Renvoyer l'avertissement de sauvegarde",
  "Max": "Max",
  "Account has insufficient balance for the requested operation. Send some value to account balance": "Le compte a insuffisant l'équilibre pour l'opération demandée. Envoyez une certaine valeur au solde du compte (> 0.02)",
  "Contract execution was terminated with error: compute phase isn't succeeded, exit code: 107. For more information about exit code check the contract source code or ask the contract developer": "L'exécution de contrat a été terminée avec erreur: la phase de calcul n'est pas réussi, sortie Code de sortie: 107. Pour plus d'informations sur le code de sortie, vérifiez le code source du contrat ou demandez au développeur du contrat.",
  "Warning": "Avertissement",
  "Warning text about restoring": "La récupération de la phrase de la graine est une méthode obsolète. Nous ne soutenons que KeyStore Restaure au premier lancement. Après avoir créé le premier portefeuille, il sera possible d'exporter l'ancien portefeuille de la phrase de la graine.",
  "No matches": "Pas de correspondance",
  "Select or enter a new one": "Sélectionnez ou entrez un nouveau",
  "Own addresses": "Propres adresses",
  "Retrieving transactions period (in minutes)": "Récupération de la période de transaction (en minutes)",
  "Fee": "Frais",
  "Total": "Le total",
  "Destination": "Destination",
  "Enter your pin code": "Entrez votre code PIN",
  "Pin code (4-8 numbers)": "Code PIN (4-8 chiffres)",
  "Pin code contains 4-8 numbers. After 1 failed attempt it will be dropped. Login will be carried out through the password entry form. Pin code can be set up again on the settings page.": "Le code PIN contient 4-8 chiffres. Après 1 tentative échouée, il sera chuté. La connexion sera effectuée via le formulaire de saisie de mot de passe. Le code PIN peut être configuré à nouveau sur la page Paramètres.",
  "Clear": "Dégager",
  "Incorrect pin code": "Code PIN incorrect",
  "Submit": "Soumettre",
  "Select permissions that you will grant to this web domain": "Sélectionnez les autorisations que vous accordez à ce domaine Web",
  "Origin": "Origine",
  "Grant": "Accorder",
  "Web page will be able to know the provider state": "La page Web sera en mesure de connaître l'état du fournisseur",
  "Method to get permissions granted by user": "Méthode pour obtenir des autorisations octroyées par l'utilisateur",
  "Method to request needed permissions from user": "Méthode pour demander des autorisations nécessaires à l'utilisateur",
  "Web page will be able to know the selected account": "La page Web sera en mesure de connaître le compte sélectionné",
  "Web page will be able to know the selected endpoint": "La page Web sera en mesure de connaître le point final sélectionné",
  "Web page will be able to initialize the transaction dialog": "La page Web sera en mesure d'initialiser la boîte de dialogue Transaction",
  "Web page will be able to subscribe on blockchain events": "La page Web sera en mesure de s'abonner sur des événements de blocage",
  "Web page will be able to initialize the signing message dialog": "La page Web sera en mesure d'initialiser la boîte de dialogue Signature du message",
  "Web page will be able to initialize the encrypting message dialog": "La page Web sera en mesure d'initialiser la boîte de dialogue du message de cryptage",
  "Web page will be able to initialize the decrypting message dialog": "La page Web pourra initialiser la boîte de dialogue du message décryptant",
  "Web page will be able to run generate_random_bytes method from crypto module": "La page Web pourra exécuter la méthode générate_random_bytes à partir de Crypto Module",
  "Web page will be able to initialize the dialog for obtaining user signature": "La page Web pourra initialiser la boîte de dialogue pour obtenir la signature de l'utilisateur.",
  "Web page will be able to unsubscribe on blockchain events": "La page Web pourra se désinscrire des événements blockchain",
  "Method uses private keys": "Méthode utilise des clés privées",
  "Web page requests invalid permissions": "Page Web Demande des autorisations non valides",
  "Please, confirm this signing only if you trust this web-page": "S'il vous plaît, confirmez cette signature que si vous faites confiance à cette page Web",
  "Web page will be able to obtain the public key for ton_encryptMessage method": "La page Web sera en mesure d'obtenir la clé publique de la méthode ton_encryptMessage",
  "Please, confirm this encryption process only if you trust this web-page": "Veuillez confirmer ce processus de cryptage uniquement si vous faites confiance à cette page Web.",
  "Please, confirm this decryption process only if you trust this web-page": "Veuillez confirmer ce processus de décryptage uniquement si vous faites confiance à cette page Web",
  "Encrypt": "Crypter",
  "Decrypt": "Déchiffrer",
  "Send to this web-page": "Envoyer à cette page Web",
  "Disclose": "Divulguer",
  "Sign": "Signe",
  "Please, provide information about your current account (address and public key) only if you trust this web-page": "Veuillez fournir des informations sur votre compte courant (adresse et clé publique) uniquement si vous faites confiance à cette page Web.",
  "Please, provide information about your current endpoint only if you trust this web-page": "Veuillez fournir des informations sur votre point final actuel uniquement si vous faites confiance à cette page Web.",
  "Please, provide information about your nacl public key only if you trust this web-page": "Veuillez fournir des informations sur votre clé publique NaCL uniquement si vous faites confiance à cette page Web.",
  "Provide": "Fournir",
  "incoming": "entrant",
  "transfer": "transfert",
  "deploy": "déployer",
  "error": "Erreur",
  "Amount can't be less than 0,001": "Montant ne peut pas être inférieur à 0,001",
  "Amount can't be more than you have": "Le montant ne peut pas être supérieur à ce que vous avez",
  "Native": "Originaire de",
  "Import token": "Jeton d'importation",
  "Import": "Importer",
  "Symbol": "symbole",
  "Icon": "Icône",
  "Type": "Taper",
  "Decimals of precision": "Décimales de précision",
  "tokenIncoming": "entrant",
  "tokenTransfer": "transfert",
  "Delete selected networks": "Supprimer les réseaux sélectionnés",
  "Delete selected assets": "Supprimer les actifs sélectionnés",
  "Manage networks": "Gérer les réseaux",
  "Manage tokens": "Gérer les jetons",
  "Tokens": "Jetons",
  "Networks": "Réseaux",
  "No tokens that you can remove": "Pas de jetons que vous pouvez supprimer",
  "No networks that you can remove": "Aucun réseaux que vous pouvez supprimer",
  "Enable TON proxy": "Activer le proxy ton",
  "Send raw transaction": "Envoyer une transaction brute",
  "State init": "Init d'État",
  "Currency to display asset cost": "Devise pour afficher le coût des actifs",
  "QR code": "QR Code",
  "Send the link": "Envoyer le lien",
  "Close": "proche",
  "Copy": "Copie",
  "Send from XTON wallet": "Envoyer du portefeuille Xton",
  "Empty list": "Liste vide",
  "Waiting for the transaction confirmation on the blockchain": "En attente de la confirmation de transaction sur la blockchain",
  "Update transactions list": "Mettre à jour la liste des transactions",
  "Item index": "Index d'article",
  "Description": "La description",
  "External link": "Lien externe",
  "NFT content": "Contenu NFT",
  "Owner": "Propriétaire",
  "Privacy policy": "Politique de confidentialité",
  "Terms of use": "Conditions d'utilisation",
  "Data": "Données",
  "Data type": "Type de données",
  "Don't ask me when reconnecting": "Ne me demandez pas quand vous reconnectez",
  "Dapp permissions": "Autorisations DAPP",
  "Manage Dapp permissions": "Gérer les autorisations DAPP",
  "Delete selected permissions": "Supprimer les autorisations sélectionnées",
  "No permissions that you can remove": "Aucune autorisation que vous pouvez supprimer",
  "Web page will be able to initialize the raw transaction dialog": "La page Web pourra initialiser la boîte de dialogue de transaction brute",
  "Web page will be able to connect by TON connect protocol": "La page Web pourra se connecter par Ton Connect Protocol",
  "Web page will be able to reconnect by TON connect protocol": "La page Web pourra reconnecter par Ton Connect Protocol",
  "Search by domain": "Recherche par domaine",
  "This transaction is expired": "Cette transaction est expirée",
  "This transaction is for another account": "Cette transaction est pour un autre compte",
  "This transaction is for another network": "Cette transaction est pour un autre réseau",
  "Extended mode": "Mode étendu"
}
