{
  "am": "አማርኛ",
  "ar": "عربى",
  "bg": "български",
  "bn": "বাংলা",
  "ca": "Català",
  "cs": "čeština",
  "da": "dansk",
  "de": "Deutsche",
  "el": "Ελληνικά",
  "en": "English",
  "es": "Español",
  "et": "Eestlane",
  "fa": "فارسی",
  "fi": "Suomalainen",
  "fil": "Pilipino",
  "fr": "français",
  "gu": "ગુજરાતી",
  "he": "עִברִית",
  "hi": "हिंदी",
  "hr": "Hrvatski",
  "hu": "Magyar",
  "id": "Bahasa Indonesia",
  "it": "Italiano",
  "ja": "日本語",
  "kn": "ಕನ್ನಡ",
  "ko": "한국어",
  "lt": "Lietuvis",
  "lv": "Latvietis",
  "ml": "മലയാളം",
  "mr": "मराठी",
  "ms": "Bahasa Melayu",
  "nl": "Nederlandse",
  "no": "norsk",
  "pl": "Polskie",
  "pt_BR": "Portugues (brasil)",
  "pt_PT": "Portugues (Portugal)",
  "ro": "Română",
  "ru": "Русский",
  "sk": "Slovák",
  "sl": "Slovenščina",
  "sr": "Српски",
  "sv": "svenska",
  "sw": "Kiswahili",
  "ta": "தமிழ்",
  "te": "తెలుగు",
  "th": "ไทย",
  "tr": "Türk",
  "uk": "Український",
  "vi": "Tiếng Việt",
  "zh_CN": "中文（中国）",
  "zh_TW": "中文（台灣）",
  "...": "การโหลด",
  "Settings": "การตั้งค่า",
  "Save": "บันทึก",
  "Language": "ภาษา",
  "Save settings": "บันทึกการตั้งค่า",
  "You can adjust all by your preference": "คุณสามารถปรับได้ทั้งหมดตามความต้องการของคุณ",
  "Cancel": "ยกเลิก",
  "Confirm": "ยืนยัน",
  "Are you sure?": "คุณแน่ใจไหม?",
  "Create a password": "สร้างรหัสผ่าน",
  "This password never changes so use a strong one that you'll remember. We recommend to use for storing": "รหัสผ่านนี้จะไม่เปลี่ยนแปลงดังนั้นให้ใช้สิ่งที่แข็งแกร่งที่คุณจำได้ เราแนะนำให้ใช้สำหรับการจัดเก็บ",
  "{charLength} or more characters": "{charLength} หรือมากกว่าตัวละคร",
  "1 lowercase letter": "1 ตัวอักษรพิมพ์เล็ก",
  "1 capital letter": "1 ฉบับเงินทุน",
  "1 number": "1 หมายเลข",
  "1 special character": "1 ตัวละครพิเศษ",
  "Save password": "บันทึกรหัสผ่าน",
  "At least 10 symbols": "อย่างน้อย 10 สัญลักษณ์",
  "Confirm password": "ยืนยันรหัสผ่าน",
  "Password": "รหัสผ่าน",
  "Keystore file confirmed": "ยืนยันไฟล์ที่เก็บคีย์",
  "Remember": "จำไว้",
  "TOS": "การจัดเก็บรหัสผ่านของคุณและสำรองกระเป๋าเงินของคุณคือ <strong> ความรับผิดชอบของคุณ </strong> สิ่งนี้เป็นสิ่งสำคัญในการรักษาความปลอดภัย cryptocurrency ของคุณ",
  "I understand": "ฉันเข้าใจ",
  "go back": "ย้อนกลับ",
  "Welcome!": "ยินดีต้อนรับ",
  "Creating a wallet is easy and secure. All accounts are encrypted locally in your browser, not on remote servers.": "การสร้างกระเป๋าเงินนั้นง่ายและปลอดภัย บัญชีทั้งหมดถูกเข้ารหัสในเครื่องในเบราว์เซอร์ของคุณไม่ใช่บนเซิร์ฟเวอร์ระยะไกล",
  "Create a wallet": "สร้างกระเป๋าเงิน",
  "Restore a wallet": "กู้คืนกระเป๋าเงิน",
  "Learn more about this wallet app": "เรียนรู้เพิ่มเติมเกี่ยวกับแอป Wallet นี้",
  "Back": "กลับ",
  "Wallet password": "รหัสผ่านกระเป๋าเงิน",
  "Upload": "ที่อัพโหลด",
  "Keystore file": "ไฟล์ที่เก็บคีย์",
  "Unlock": "ปลดล็อค",
  "Keystore password": "รหัสผ่านที่เก็บคีย์",
  "Restore": "ฟื้นฟู",
  "Make your choice": "ทำให้คุณเลือก",
  "Complete": "สมบูรณ์",
  "Process end": "สิ้นสุดกระบวนการ",
  "Make it good": "ทำให้ดี",
  "Consent": "การยินยอม",
  "Agree to terms": "เห็นด้วยกับข้อตกลง",
  "Creating keys": "การสร้างคีย์",
  "Ensure to save": "ตรวจสอบให้แน่ใจว่าได้บันทึก",
  "Deployment": "การปรับใช้",
  "On blockchain": "บน blockchain",
  "Print": "พิมพ์",
  "Save as file": "บันทึกเป็นไฟล์",
  "Send on email": "ส่งอีเมล",
  "Your seed phrase": "วลีเมล็ดของคุณ",
  "Deploy wallet on blockchain": "ปรับใช้ wallet บน blockchain",
  "I have saved in strong place": "ฉันได้บันทึกไว้ในที่ที่แข็งแกร่ง",
  "Deployment process": "กระบวนการปรับใช้",
  "Awaiting the transaction from the giver": "รอการทำธุรกรรมจากผู้ให้",
  "Loading": "การโหลด",
  "Network": "เครือข่าย",
  "Deploy": "ปรับใช้",
  "Deploy wallet instructions": "สำหรับการใช้งานกระเป๋าสตางค์จำเป็นต้องปรับใช้สัญญาอัจฉริยะ มีค่าใช้จ่ายบางอย่างที่คุณต้องมีในที่อยู่ของกระเป๋าเงินนี้ หากคุณพยายามปรับใช้กระเป๋าเงินบน Testnet คุณสามารถใช้ `Giver 'เพื่อใช้จำนวนเงินเริ่มต้นนี้",
  "Take from giver": "รับจากผู้ให้",
  "Balance": "สมดุล",
  "Message expired. Contract was not executed on chain. Possible reason: Account has insufficient balance for the requested operation. Send some value to account balance": "ข้อความหมดอายุ สัญญาไม่ได้ดำเนินการในห่วงโซ่ เหตุผลที่เป็นไปได้: บัญชีมียอดคงเหลือไม่เพียงพอสำหรับการดำเนินการที่ร้องขอ ส่งค่าบางอย่างไปยังยอดเงินในบัญชี",
  "Check balance": "ตรวจสอบยอดคงเหลือ",
  "Access your wallet": "เข้าถึงกระเป๋าเงินของคุณ",
  "Incorrect password": "รหัสผ่านผิดพลาด",
  "Restore wallet": "เรียกคืนกระเป๋าสตางค์",
  "Fetch first block failed: Can not send http request: Failed to fetch": "ดึงบล็อกแรกล้มเหลว: ไม่สามารถส่งคำขอ HTTP ในเครือข่ายนี้",
  "Finishing up": "เสร็จสิ้น",
  "Done!": "เสร็จแล้ว!",
  "Backup wallet": "กระเป๋าสตางค์สำรอง",
  "Backup description": "กระบวนการนี้จะช่วยให้คุณสามารถสร้างที่เก็บคีย์ที่เข้ารหัสหรือถอดรหัสและดูคีย์ลับทั้งหมดของคุณ",
  "Backup warning": "การสำรองข้อมูลที่ปลอดภัยคือความรับผิดชอบของคุณ",
  "Create backup file": "สร้างไฟล์สำรอง",
  "View account keys": "ดูคีย์บัญชี",
  "Set password": "ตั้งรหัสผ่าน",
  "Generate file": "สร้างไฟล์",
  "Just a second": "รอสักครู่",
  "Download": "ดาวน์โหลด",
  "Keep it safe": "รักษาความปลอดภัยให้ปลอดภัย",
  "Keystore security": "เพื่อความปลอดภัยสูงสุดจำเป็นต้องเก็บไว้ในตัวจัดการรหัสผ่านเช่น",
  "Password hint (Optional)": "คำใบ้รหัสผ่าน (ไม่บังคับ)",
  "Create a password hint": "สร้างคำใบ้รหัสผ่าน",
  "Create keystore": "สร้างที่เก็บคีย์",
  "Security": "การรักษาความปลอดภัย",
  "Sign out & lock": "ออกจากระบบ & ล็อค",
  "Sign out": "ออกจากระบบ",
  "Information": "ข้อมูล",
  "About app": "เกี่ยวกับแอพ",
  "Give feedback": "ให้ข้อเสนอแนะ",
  "Help": "ช่วยด้วย",
  "Team is not responsible for lost or stolen passwords": "ทีมจะไม่รับผิดชอบรหัสผ่านที่สูญหายหรือถูกขโมย",
  "Creating keystore": "การสร้างที่เก็บคีย์",
  "Backup content": "การสำรองข้อมูลนี้มีบัญชีปัจจุบันในกระเป๋าเงินของคุณ การสำรองข้อมูลที่ตามมาจะต้องใช้เมื่อมีการเพิ่มบัญชีในอนาคต",
  "Safe storage of your keystore and password are important to keeping your cryptocurrency safe.": "การจัดเก็บที่ปลอดภัยของที่เก็บคีย์และรหัสผ่านของคุณเป็นสิ่งสำคัญในการรักษาความปลอดภัย cryptocurrency ของคุณ",
  "To store backup safely we recommend to use": "ในการเก็บสำรองข้อมูลอย่างปลอดภัยเราแนะนำให้ใช้",
  "Full export": "ส่งออกเต็มรูปแบบ",
  "If you want to save all contracts added on accounts, all transactions related with accounts, then tick the checkbox.": "หากคุณต้องการบันทึกสัญญาทั้งหมดที่เพิ่มในบัญชีธุรกรรมทั้งหมดที่เกี่ยวข้องกับบัญชีจากนั้นทำเครื่องหมายที่ช่องทำเครื่องหมาย",
  "Download file": "ดาวน์โหลดไฟล์",
  "Home": "บ้าน",
  "Decrypted account addresses": "ที่อยู่บัญชีถอดรหัส",
  "These are all the secret keys stored in your wallet": "เหล่านี้เป็นปุ่มลับทั้งหมดที่เก็บไว้ในกระเป๋าเงินของคุณ",
  "Backup keys": "ปุ่มสำรอง",
  "Back to home": "กลับไปที่บ้าน",
  "Wallet address": "ที่อยู่กระเป๋าสตางค์",
  "Secret key": "คีย์ลับ",
  "Public key": "กุญแจสาธารณะ",
  "Nickname": "ชื่อเล่น",
  "Address/Keys": "ที่อยู่ / คีย์",
  "Address": "ที่อยู่",
  "Restoring accounts to your wallet is quick and easy": "การกู้คืนบัญชีไปยังกระเป๋าเงินของคุณนั้นง่ายและรวดเร็ว",
  "You have several ways to process this. Please prepare needed file and password.": "คุณมีหลายวิธีในการประมวลผลนี้ โปรดเตรียมไฟล์และรหัสผ่านที่จำเป็น",
  "Restore from keystore": "คืนค่าจากที่เก็บคีย์",
  "For keystore": "สำหรับที่เก็บคีย์",
  "Decide": "ตัดสินใจ",
  "Select accounts": "เลือกบัญชี",
  "Return to wallet": "กลับไปที่กระเป๋าเงิน",
  "Restore from keys": "คืนค่าจากคีย์",
  "Restore from seed phrase": "คืนค่าจากวลีเมล็ด",
  "Restore accounts": "กู้คืนบัญชี",
  "To restore your accounts, please upload the keystore file created during your backup.": "หากต้องการคืนค่าบัญชีของคุณโปรดอัปโหลดไฟล์ที่เก็บคีย์ที่สร้างขึ้นระหว่างการสำรองข้อมูลของคุณ",
  "Click here to choose a file": "คลิกที่นี่เพื่อเลือกไฟล์",
  "or drag and drop your file below.": "หรือลากและวางไฟล์ของคุณด้านล่าง",
  "Drop file here": "วางไฟล์ที่นี่",
  "Confirm keystore": "ยืนยันที่เก็บคีย์",
  "Enter your keystore file password.": "ป้อนรหัสผ่านไฟล์ที่เก็บคีย์ของคุณ",
  "last modified date": "วันที่แก้ไขล่าสุด",
  "Password hint": "คำใบ้รหัสผ่าน",
  "Checking keystore": "การตรวจสอบที่เก็บคีย์",
  "Oops": "โอ๊ะโอ",
  "This is not a valid keystore file.": "นี่ไม่ใช่ไฟล์ที่เก็บคีย์ที่ถูกต้อง",
  "All wallets": "กระเป๋าเงินทั้งหมด",
  "Password confirmed": "ยืนยันรหัสผ่าน",
  "Almost there! Now let's select which accounts you'd like to restore": "เกือบจะมี! ตอนนี้ลองเลือกบัญชีที่คุณต้องการกู้คืน",
  "Saving accounts to wallet": "บันทึกบัญชีไปยังกระเป๋าเงิน",
  "Accounts restored": "กู้คืนบัญชี",
  "You've added the following wallets succesfully! You may now perform transactions using these addresses.": "คุณได้เพิ่มกระเป๋าเงินต่อไปนี้! ตอนนี้คุณสามารถทำธุรกรรมโดยใช้ที่อยู่เหล่านี้",
  "Finish": "เสร็จสิ้น",
  "Existed": "มีอยู่จริง",
  "Added": "เพิ่ม",
  "Restore wallet by keys": "คืนค่ากระเป๋าสตางค์ด้วยกุญแจ",
  "Specify your keys.": "ระบุคีย์ของคุณ",
  "Add wallet": "เพิ่มกระเป๋าเงิน",
  "Restore wallet by seed phrase": "คืนค่ากระเป๋าสตางค์ตามวลีเมล็ด",
  "Specify your seed phrase.": "ระบุวลีเมล็ดของคุณ",
  "Add": "เพิ่ม",
  "Buy": "ซื้อ",
  "Giver": "ผู้ให้",
  "Swap": "การแลกเปลี่ยน",
  "Assets": "สินทรัพย์",
  "Transactions": "การทำธุรกรรม",
  "Accounts": "บัญชี",
  "Edit nickname": "แก้ไขชื่อเล่น",
  "View on explorer": "ดู explorer",
  "Delete account": "ลบบัญชี",
  "Send transaction": "ส่งธุรกรรม",
  "Edit account nickname": "แก้ไขชื่อเล่นบัญชี",
  "This action will remove the account. If you have there any assets, please to do backup before confirmation.": "การกระทำนี้จะลบบัญชี หากคุณมีทรัพย์สินใด ๆ โปรดสำรองข้อมูลก่อนยืนยัน",
  "Delete": "ลบ",
  "You can't delete the only account": "คุณไม่สามารถลบบัญชีเดียวได้",
  "Amount is received": "ได้รับจำนวนเงิน",
  "Error": "ข้อผิดพลาด",
  "Success": "ความสำเร็จ",
  "The wallet has been deployed": "กระเป๋าเงินถูกนำไปใช้แล้ว",
  "Contract execution was terminated with error: compute phase isn't succeeded, exit code: 51 (Constructor was already called). Contract cannot be redeployed. For more information about exit code check the contract source code or ask the contract developer": "การดำเนินการตามสัญญาถูกยกเลิกด้วยข้อผิดพลาด: การคำนวณขั้นตอนไม่สำเร็จรหัสออก: 51 (Constructor ถูกเรียกว่า) สัญญาไม่สามารถปรับใช้ใหม่ได้ สำหรับข้อมูลเพิ่มเติมเกี่ยวกับรหัสออกตรวจสอบซอร์สโค้ดสัญญาหรือถามผู้พัฒนาสัญญา",
  "Account does not exist. You need to transfer funds to this account first to have a positive balance and then deploy its code. Possible reason: Account does not exist. You need to transfer funds to this account first to have a positive balance and then deploy its code": "บัญชีไม่มีอยู่ คุณต้องโอนเงินไปยังบัญชีนี้ก่อนที่จะมียอดคงเหลือในเชิงบวกแล้วปรับใช้รหัส",
  "Amount": "จำนวน",
  "Message": "ข้อความ",
  "Send": "ส่ง",
  "Version": "รุ่น",
  "About text": "นี่คือแอปพลิเคชันรหัสโอเพนซอร์ส คุณสามารถประเมินความปลอดภัยได้ตลอดเวลาโดยการวิเคราะห์รหัสใน GitHub หากคุณมีความปรารถนาและข้อเสนอแนะใด ๆ โปรดใช้รายการเมนูคำติชมเพื่อติดต่อเรา",
  "Visit website": "เข้าไปดูในเว็บไซต์",
  "Try TON blockchain web-extension": "ลองใช้การขยายเว็บ Ton Blockchain ฟรี",
  "Add new network": "เพิ่มเครือข่ายใหม่",
  "Specify your settings.": "ระบุการตั้งค่าของคุณ",
  "Name": "ชื่อ",
  "Server": "เซิร์ฟเวอร์",
  "Explorer": "สำรวจ",
  "Test network": "เครือข่ายทดสอบ",
  "Giver on test network": "Giver บนเครือข่ายทดสอบ",
  "Coin name": "ชื่อเหรียญ",
  "Wallet": "กระเป๋าสตางค์",
  "Autologout (in minutes)": "Autologout (ในไม่กี่นาที)",
  "Open page": "หน้าเปิด",
  "Skip this step": "ข้ามขั้นตอนนี้",
  "Dismiss backup warning": "ยกเลิกคำเตือนการสำรองข้อมูล",
  "Max": "สูงสุด",
  "Account has insufficient balance for the requested operation. Send some value to account balance": "บัญชีมียอดคงเหลือไม่เพียงพอสำหรับการดำเนินงานที่ร้องขอ ส่งค่าไปยังยอดเงินในบัญชี",
  "Contract execution was terminated with error: compute phase isn't succeeded, exit code: 107. For more information about exit code check the contract source code or ask the contract developer": "การดำเนินการตามสัญญาถูกยกเลิกด้วยข้อผิดพลาด: การคำนวณขั้นตอนไม่สำเร็จออกรหัส: 107 สำหรับข้อมูลเพิ่มเติมเกี่ยวกับรหัสออกตรวจสอบรหัสที่มาของสัญญาหรือถามผู้พัฒนาสัญญา",
  "Warning": "คำเตือน",
  "Warning text about restoring": "การกู้คืนวลีเมล็ดพันธุ์เป็นวิธีการที่ล้าสมัย เรารองรับการคืนค่าที่เก็บคีย์ในการเปิดใช้งานครั้งแรกเท่านั้น หลังจากสร้างกระเป๋าเงินใบแรกแล้ว จะสามารถส่งออกกระเป๋าเงินเก่าจากวลีเริ่มต้นได้",
  "No matches": "ไม่ตรงกัน",
  "Select or enter a new one": "เลือกหรือป้อนใหม่",
  "Own addresses": "ที่อยู่ของตัวเอง",
  "Retrieving transactions period (in minutes)": "การเรียกคืนระยะเวลาธุรกรรม (เป็นนาที)",
  "Fee": "ค่าธรรมเนียม",
  "Total": "รวม",
  "Destination": "ปลายทาง",
  "Enter your pin code": "ป้อนรหัส PIN ของคุณ",
  "Pin code (4-8 numbers)": "รหัส PIN (หมายเลข 4-8)",
  "Pin code contains 4-8 numbers. After 1 failed attempt it will be dropped. Login will be carried out through the password entry form. Pin code can be set up again on the settings page.": "รหัส PIN มีหมายเลข 4-8 หลังจาก 1 ความพยายามล้มเหลวมันจะลดลง การเข้าสู่ระบบจะดำเนินการผ่านแบบฟอร์มการป้อนรหัสผ่าน รหัส PIN สามารถตั้งค่าอีกครั้งในหน้าการตั้งค่า",
  "Clear": "ชัดเจน",
  "Incorrect pin code": "รหัส PIN ไม่ถูกต้อง",
  "Submit": "ส่ง",
  "Select permissions that you will grant to this web domain": "เลือกสิทธิ์ที่คุณจะให้กับโดเมนเว็บนี้",
  "Origin": "ต้นทาง",
  "Grant": "ยินยอม",
  "Web page will be able to know the provider state": "หน้าเว็บจะสามารถทราบสถานะผู้ให้บริการ",
  "Method to get permissions granted by user": "วิธีการรับสิทธิ์ที่ได้รับจากผู้ใช้",
  "Method to request needed permissions from user": "วิธีการขอสิทธิ์ที่จำเป็นจากผู้ใช้",
  "Web page will be able to know the selected account": "เว็บเพจจะสามารถทราบบัญชีที่เลือกได้",
  "Web page will be able to know the selected endpoint": "หน้าเว็บจะสามารถรู้จุดสิ้นสุดที่เลือกได้",
  "Web page will be able to initialize the transaction dialog": "หน้าเว็บจะสามารถเริ่มต้นกล่องโต้ตอบการทำธุรกรรมได้",
  "Web page will be able to subscribe on blockchain events": "เว็บเพจจะสามารถสมัครสมาชิกกิจกรรม Blockchain ได้",
  "Web page will be able to initialize the signing message dialog": "หน้าเว็บจะสามารถเริ่มต้นไดอะล็อกข้อความลงชื่อเข้าใช้",
  "Web page will be able to initialize the encrypting message dialog": "หน้าเว็บจะสามารถเริ่มต้นการเริ่มต้นการเข้ารหัสข้อความการเข้ารหัส",
  "Web page will be able to initialize the decrypting message dialog": "หน้าเว็บจะสามารถเริ่มต้นไดอะล็อกข้อความถอดรหัสได้",
  "Web page will be able to run generate_random_bytes method from crypto module": "เว็บเพจจะสามารถเรียกใช้วิธีการ generate_random_bytes จากโมดูล Crypto",
  "Web page will be able to initialize the dialog for obtaining user signature": "เว็บเพจจะสามารถเริ่มต้นไดอะล็อกสำหรับการได้รับลายเซ็นผู้ใช้",
  "Web page will be able to unsubscribe on blockchain events": "หน้าเว็บจะสามารถยกเลิกการสมัครกิจกรรม blockchain ได้",
  "Method uses private keys": "วิธีใช้ปุ่มส่วนตัว",
  "Web page requests invalid permissions": "หน้าเว็บร้องขอการอนุญาตที่ไม่ถูกต้อง",
  "Please, confirm this signing only if you trust this web-page": "โปรดยืนยันการลงนามนี้หากคุณเชื่อถือหน้าเว็บนี้",
  "Web page will be able to obtain the public key for ton_encryptMessage method": "เว็บเพจจะสามารถรับกุญแจสาธารณะสำหรับวิธี ton_encryptMessage",
  "Please, confirm this encryption process only if you trust this web-page": "โปรดยืนยันขั้นตอนการเข้ารหัสนี้หากคุณเชื่อถือหน้าเว็บนี้",
  "Please, confirm this decryption process only if you trust this web-page": "กรุณายืนยันขั้นตอนการถอดรหัสนี้หากคุณเชื่อถือหน้าเว็บนี้",
  "Encrypt": "เข้ารหัส",
  "Decrypt": "ถอดรหัส",
  "Send to this web-page": "ส่งไปยังหน้าเว็บนี้",
  "Disclose": "เปิดเผย",
  "Sign": "เข้าสู่ระบบ",
  "Please, provide information about your current account (address and public key) only if you trust this web-page": "โปรดระบุข้อมูลเกี่ยวกับบัญชีปัจจุบันของคุณ (ที่อยู่และรหัสสาธารณะ) เฉพาะในกรณีที่คุณเชื่อถือหน้าเว็บนี้",
  "Please, provide information about your current endpoint only if you trust this web-page": "โปรดระบุข้อมูลเกี่ยวกับจุดสิ้นสุดปัจจุบันของคุณเฉพาะในกรณีที่คุณเชื่อถือหน้าเว็บนี้",
  "Please, provide information about your nacl public key only if you trust this web-page": "โปรดระบุข้อมูลเกี่ยวกับกุญแจสาธารณะ NACL ของคุณเท่านั้นหากคุณเชื่อถือหน้าเว็บนี้",
  "Provide": "จัดเตรียม",
  "incoming": "ที่เข้ามา",
  "transfer": "โอนย้าย",
  "deploy": "ปรับใช้",
  "error": "ข้อผิดพลาด",
  "Amount can't be less than 0,001": "จำนวนเงินไม่สามารถน้อยกว่า 0,001",
  "Amount can't be more than you have": "จำนวนเงินไม่สามารถมากกว่าที่คุณมี",
  "Native": "พื้นเมือง",
  "Import token": "โทเค็นนำเข้า",
  "Import": "การนำเข้า",
  "Symbol": "สัญลักษณ์",
  "Icon": "ไอคอน",
  "Type": "พิมพ์",
  "Decimals of precision": "ทศนิยมของความแม่นยำ",
  "tokenIncoming": "ที่เข้ามา",
  "tokenTransfer": "โอนย้าย",
  "Delete selected networks": "ลบเครือข่ายที่เลือก",
  "Delete selected assets": "ลบสินทรัพย์ที่เลือก",
  "Manage networks": "จัดการเครือข่าย",
  "Manage tokens": "จัดการโทเค็น",
  "Tokens": "โทเค็น",
  "Networks": "เครือข่าย",
  "No tokens that you can remove": "ไม่มีโทเค็นที่คุณสามารถลบได้",
  "No networks that you can remove": "ไม่มีเครือข่ายที่คุณสามารถลบได้",
  "Enable TON proxy": "เปิดใช้งานพร็อกซีตัน",
  "Send raw transaction": "ส่งธุรกรรมดิบ",
  "Currency to display asset cost": "สกุลเงินเพื่อแสดงต้นทุนสินทรัพย์",
  "State init ": "รัฐเริ่มต้น",
  "QR code": "คิวอาร์โค้ด",
  "Send the link": "ส่งลิงค์",
  "Close": "ปิด I",
  "Copy": "สำเนา",
  "Send from XTON wallet": "ส่งจาก wallet xton",
  "Empty list": "รายการเปล่า",
  "Waiting for the transaction confirmation on the blockchain": "กำลังรอการยืนยันการทำธุรกรรมบน blockchain",
  "Update transactions list": "อัปเดตรายการธุรกรรม"
}
