{
  "am": "አማርኛ",
  "ar": "عربى",
  "bg": "български",
  "bn": "বাংলা",
  "ca": "Català",
  "cs": "čeština",
  "da": "dansk",
  "de": "Deutsche",
  "el": "Ελληνικά",
  "en": "English",
  "es": "Español",
  "et": "Eestlane",
  "fa": "فارسی",
  "fi": "Suomalainen",
  "fil": "Pilipino",
  "fr": "français",
  "gu": "ગુજરાતી",
  "he": "עִברִית",
  "hi": "हिंदी",
  "hr": "Hrvatski",
  "hu": "Magyar",
  "id": "Bahasa Indonesia",
  "it": "Italiano",
  "ja": "日本語",
  "kn": "ಕನ್ನಡ",
  "ko": "한국어",
  "lt": "Lietuvis",
  "lv": "Latvietis",
  "ml": "മലയാളം",
  "mr": "मराठी",
  "ms": "Bahasa Melayu",
  "nl": "Nederlandse",
  "no": "norsk",
  "pl": "Polskie",
  "pt_BR": "Portugues (brasil)",
  "pt_PT": "Portugues (Portugal)",
  "ro": "Română",
  "ru": "Русский",
  "sk": "Slovák",
  "sl": "Slovenščina",
  "sr": "Српски",
  "sv": "svenska",
  "sw": "Kiswahili",
  "ta": "தமிழ்",
  "te": "తెలుగు",
  "th": "ไทย",
  "tr": "Türk",
  "uk": "Український",
  "vi": "Tiếng Việt",
  "zh_CN": "中文（中国）",
  "zh_TW": "中文（台灣）",
  "...": "Đang tải",
  "Settings": "Cài đặt",
  "Save": "Tiết kiệm",
  "Language": "Ngôn ngữ",
  "Save settings": "Lưu các thiết lập",
  "You can adjust all by your preference": "Bạn có thể điều chỉnh tất cả theo sở thích của bạn",
  "Cancel": "Hủy bỏ",
  "Confirm": "Xác nhận",
  "Are you sure?": "Bạn có chắc không?",
  "Create a password": "Tạo một mật khẩu",
  "This password never changes so use a strong one that you'll remember. We recommend to use for storing": "Mật khẩu này không bao giờ thay đổi vì vậy hãy sử dụng một mật khẩu mạnh mẽ mà bạn sẽ nhớ. Chúng tôi khuyên bạn nên sử dụng để lưu trữ",
  "{charLength} or more characters": "{charLength} trở lên",
  "1 lowercase letter": "1 chữ thường",
  "1 capital letter": "1 chữ hoa",
  "1 number": "1 số",
  "1 special character": "1 nhân vật đặc biệt",
  "Save password": "Lưu mật khẩu",
  "At least 10 symbols": "Ít nhất 10 biểu tượng",
  "Confirm password": "Xác nhận mật khẩu",
  "Password": "Mật khẩu",
  "Keystore file confirmed": "Xác nhận tập tin Keystore",
  "Remember": "Nhớ lại",
  "TOS": "Lưu mật khẩu của bạn và sao lưu ví của bạn là <strong> trách nhiệm của bạn </strong>. Điều này rất quan trọng để giữ an toàn tiền điện tử của bạn.",
  "I understand": "tôi hiểu",
  "go back": "quay lại",
  "Welcome!": "Chào mừng bạn!",
  "Creating a wallet is easy and secure. All accounts are encrypted locally in your browser, not on remote servers.": "Tạo một ví rất dễ dàng và an toàn. Tất cả các tài khoản được mã hóa cục bộ trong trình duyệt của bạn, không phải trên các máy chủ từ xa.",
  "Create a wallet": "Tạo một ví.",
  "Restore a wallet": "Khôi phục một ví.",
  "Learn more about this wallet app": "Tìm hiểu thêm về ứng dụng ví này",
  "Back": "Trở lại",
  "Wallet password": "Mật khẩu ví",
  "Upload": "Tải lên",
  "Keystore file": "Tệp Keystore",
  "Unlock": "Mở khóa",
  "Keystore password": "Mật khẩu Keystore",
  "Restore": "Khôi phục.",
  "Make your choice": "Đưa ra lựa chọn của bạn",
  "Complete": "Hoàn thành",
  "Process end": "Quy trình kết thúc.",
  "Make it good": "Làm cho nó tốt",
  "Consent": "Bằng lòng",
  "Agree to terms": "Đồng ý với các điều khoản.",
  "Creating keys": "Tạo các phím",
  "Ensure to save": "Đảm bảo tiết kiệm",
  "Deployment": "Triển khai.",
  "On blockchain": "Trên blockchain.",
  "Print": "In",
  "Save as file": "Lưu dưới dạng tệp",
  "Send on email": "Gửi email",
  "Your seed phrase": "Cụm từ hạt giống của bạn",
  "Deploy wallet on blockchain": "Triển khai ví trên blockchain",
  "I have saved in strong place": "Tôi đã cứu ở nơi mạnh mẽ",
  "Deployment process": "Quá trình triển khai",
  "Awaiting the transaction from the giver": "Đang chờ giao dịch từ người cho",
  "Loading": "Đang tải",
  "Network": "Mạng.",
  "Deploy": "Triển khai.",
  "Deploy wallet instructions": "Để sử dụng ví cần triển khai hợp đồng thông minh. Nó tốn một số tiền mà bạn phải có trên địa chỉ của ví này. Nếu bạn đang cố gắng triển khai ví trên testnet, bạn có thể sử dụng `giver` để lấy số tiền ban đầu này.",
  "Take from giver": "Lấy từ Giver.",
  "Balance": "Thăng bằng",
  "Message expired. Contract was not executed on chain. Possible reason: Account has insufficient balance for the requested operation. Send some value to account balance": "Tin nhắn hết hạn. Hợp đồng không được thực hiện trên chuỗi. Lý do có thể: Tài khoản không có số dư không đủ cho hoạt động được yêu cầu. Gửi một số giá trị vào số dư tài khoản",
  "Check balance": "Kiểm tra số dư.",
  "Access your wallet": "Truy cập ví của bạn",
  "Incorrect password": "mật khẩu không đúng",
  "Restore wallet": "Khôi phục ví",
  "Fetch first block failed: Can not send http request: Failed to fetch": "Fetch Khối đầu tiên không thành công: Không thể gửi yêu cầu HTTP trên mạng này",
  "Finishing up": "Hoàn thiện",
  "Done!": "Làm xong!",
  "Backup wallet": "Ví dự phòng.",
  "Backup description": "Quá trình này sẽ cho phép bạn tạo kho khóa được mã hóa hoặc giải mã và xem tất cả các khóa bí mật của bạn.",
  "Backup warning": "Giữ Sao lưu an toàn là trách nhiệm của bạn.",
  "Create backup file": "Tạo tập tin sao lưu",
  "View account keys": "Xem các khóa tài khoản.",
  "Set password": "Đặt mật khẩu",
  "Generate file": "Tạo tập tin",
  "Just a second": "Chỉ một giây thôi",
  "Download": "Tải xuống",
  "Keep it safe": "Giữ an toàn",
  "Keystore security": "Để bảo mật tối đa cần lưu trữ trong trình quản lý mật khẩu, chẳng hạn như",
  "Password hint (Optional)": "Gợi ý mật khẩu tùy chọn)",
  "Create a password hint": "Tạo một gợi ý mật khẩu",
  "Create keystore": "Tạo kho khóa",
  "Security": "Bảo vệ",
  "Sign out & lock": "Đăng xuất và khóa",
  "Sign out": "Đăng xuất",
  "Information": "Thông tin",
  "About app": "Về ứng dụng.",
  "Give feedback": "Đưa ra phản hồi",
  "Help": "Cứu giúp",
  "Team is not responsible for lost or stolen passwords": "Đội không chịu trách nhiệm về mật khẩu bị mất hoặc bị đánh cắp",
  "Creating keystore": "Tạo kho khóa",
  "Backup content": "Bản sao lưu này chứa các tài khoản hiện tại trong ví của bạn. Các bản sao lưu tiếp theo sẽ cần thiết khi các tài khoản trong tương lai được thêm vào.",
  "Safe storage of your keystore and password are important to keeping your cryptocurrency safe.": "Lưu trữ an toàn của kho khóa và mật khẩu của bạn rất quan trọng để giữ an toàn tiền điện tử của bạn.",
  "To store backup safely we recommend to use": "Để lưu trữ sao lưu một cách an toàn, chúng tôi khuyên bạn nên sử dụng",
  "Full export": "Xuất khẩu đầy đủ",
  "If you want to save all contracts added on accounts, all transactions related with accounts, then tick the checkbox.": "Nếu bạn muốn lưu tất cả các hợp đồng được thêm vào trên tài khoản, tất cả các giao dịch liên quan đến tài khoản, sau đó đánh dấu vào hộp kiểm.",
  "Download file": "Tải tập tin",
  "Home": "Trang Chủ",
  "Decrypted account addresses": "Địa chỉ tài khoản được giải mã",
  "These are all the secret keys stored in your wallet": "Đây là tất cả các khóa bí mật được lưu trong ví của bạn",
  "Backup keys": "Phím dự phòng",
  "Back to home": "Trở về nhà",
  "Wallet address": "Địa chỉ ví",
  "Secret key": "Chìa khoá bí mật",
  "Public key": "Khóa công khai",
  "Nickname": "Tên nick",
  "Address/Keys": "Địa chỉ / khóa",
  "Address": "Địa chỉ",
  "Restoring accounts to your wallet is quick and easy": "Khôi phục tài khoản cho ví của bạn là nhanh chóng và dễ dàng",
  "You have several ways to process this. Please prepare needed file and password.": "Bạn có một số cách để xử lý việc này. Vui lòng chuẩn bị tập tin và mật khẩu cần thiết.",
  "Restore from keystore": "Khôi phục từ kho khóa.",
  "For keystore": "Cho kho khóa",
  "Decide": "Quyết định",
  "Select accounts": "Chọn Tài khoản",
  "Return to wallet": "Quay trở lại ví.",
  "Restore from keys": "Khôi phục từ khóa",
  "Restore from seed phrase": "Khôi phục từ cụm từ hạt giống",
  "Restore accounts": "Khôi phục tài khoản",
  "To restore your accounts, please upload the keystore file created during your backup.": "Để khôi phục tài khoản của bạn, vui lòng tải lên tệp keystore được tạo trong quá trình sao lưu của bạn.",
  "Click here to choose a file": "Nhấn vào đây để chọn một tập tin",
  "or drag and drop your file below.": "hoặc kéo và thả tập tin của bạn dưới đây.",
  "Drop file here": "Thả tập tin ở đây",
  "Confirm keystore": "Xác nhận kho khóa",
  "Enter your keystore file password.": "Nhập mật khẩu tệp khóa của bạn.",
  "last modified date": "Ngày sửa đổi lần cuối",
  "Password hint": "Gợi ý mật khẩu",
  "Checking keystore": "Kiểm tra kho khóa.",
  "Oops": "Giáo sư",
  "This is not a valid keystore file.": "Đây không phải là một tệp khóa hợp lệ.",
  "All wallets": "Tất cả ví.",
  "Password confirmed": "Xác nhận mật khẩu",
  "Almost there! Now let's select which accounts you'd like to restore": "Gần như ở đó! Bây giờ hãy chọn tài khoản bạn muốn khôi phục",
  "Saving accounts to wallet": "Tiết kiệm tài khoản vào ví",
  "Accounts restored": "Tài khoản được khôi phục",
  "You've added the following wallets succesfully! You may now perform transactions using these addresses.": "Bạn đã thêm các ví sau đây một cách thành công! Bây giờ bạn có thể thực hiện các giao dịch bằng cách sử dụng các địa chỉ này.",
  "Finish": "Hoàn thành",
  "Existed": "Tồn tại",
  "Added": "Thêm",
  "Restore wallet by keys": "Khôi phục ví theo phím",
  "Specify your keys.": "Chỉ định chìa khóa của bạn.",
  "Add wallet": "Thêm ví.",
  "Restore wallet by seed phrase": "Khôi phục ví bằng cụm từ hạt giống",
  "Specify your seed phrase.": "Chỉ định cụm từ hạt giống của bạn.",
  "Add": "Thêm vào",
  "Buy": "Mua",
  "Giver": "Người cho",
  "Swap": "Trao đổi",
  "Assets": "Tài sản",
  "Transactions": "Giao dịch",
  "Accounts": "Tài khoản",
  "Edit nickname": "Chỉnh sửa biệt danh",
  "View on explorer": "Xem trên Explorer.",
  "Delete account": "Xóa tài khoản",
  "Send transaction": "Gửi giao dịch",
  "Edit account nickname": "Chỉnh sửa Nickname",
  "This action will remove the account. If you have there any assets, please to do backup before confirmation.": "Hành động này sẽ xóa tài khoản. Nếu bạn có bất kỳ tài sản nào, xin vui lòng sao lưu trước khi xác nhận.",
  "Delete": "Xóa bỏ",
  "You can't delete the only account": "Bạn không thể xóa tài khoản duy nhất",
  "Amount is received": "Số tiền được nhận",
  "Error": "lỗi",
  "Success": "Sự thành công",
  "The wallet has been deployed": "Ví đã được triển khai",
  "Contract execution was terminated with error: compute phase isn't succeeded, exit code: 51 (Constructor was already called). Contract cannot be redeployed. For more information about exit code check the contract source code or ask the contract developer": "Thực thi hợp đồng đã bị chấm dứt lỗi: Pha theo giai đoạn không thành công, xuất mã: 51 (hàm tạo đã được gọi). Hợp đồng không thể được triển khai lại. Để biết thêm thông tin về mã thoát, hãy kiểm tra mã nguồn hợp đồng hoặc hỏi nhà phát triển hợp đồng",
  "Account does not exist. You need to transfer funds to this account first to have a positive balance and then deploy its code. Possible reason: Account does not exist. You need to transfer funds to this account first to have a positive balance and then deploy its code": "Tài khoản không tồn tại. Bạn cần chuyển tiền vào tài khoản này trước để có số dư tích cực và sau đó triển khai mã của nó",
  "Amount": "Số tiền",
  "Message": "Thông điệp",
  "Send": "Gửi.",
  "Version": "Phiên bản",
  "About text": "Đây là ứng dụng mã nguồn mở. Bạn luôn có thể đánh giá sự an toàn của nó bằng cách phân tích mã trên GitHub. Nếu bạn có bất kỳ mong muốn và đề xuất nào, vui lòng sử dụng mục menu phản hồi để liên hệ với chúng tôi.",
  "Visit website": "Truy cập trang web",
  "Try TON blockchain web-extension": "Thử miễn phí Ton Blockchain mở rộng web",
  "Add new network": "Thêm mạng mới",
  "Specify your settings.": "Chỉ định cài đặt của bạn.",
  "Name": "Tên",
  "Server": "Người phục vụ",
  "Explorer": "nhà thám hiểm",
  "Test network": "Mạng thử nghiệm",
  "Giver on test network": "Giver trên mạng thử nghiệm",
  "Coin name": "Tên tiền xu.",
  "Wallet": "Ví tiền",
  "Autologout (in minutes)": "Tự động (tính bằng phút)",
  "Open page": "Mở trang",
  "Skip this step": "Bỏ qua bước này",
  "Dismiss backup warning": "Loại bỏ cảnh báo sao lưu",
  "Max": "Tối đa",
  "Account has insufficient balance for the requested operation. Send some value to account balance": "Tài khoản không có đủ số dư cho các hoạt động được yêu cầu. Gửi một số giá trị vào số dư tài khoản.",
  "Contract execution was terminated with error: compute phase isn't succeeded, exit code: 107. For more information about exit code check the contract source code or ask the contract developer": "Thực thi hợp đồng đã bị chấm dứt với lỗi: Tính toán giai đoạn không thành công, thoát mã: 107. Để biết thêm thông tin về mã thoát Kiểm tra mã nguồn hợp đồng hoặc hỏi nhà phát triển hợp đồng",
  "Warning": "Cảnh báo",
  "Warning text about restoring": "Phục hồi cụm từ hạt giống là một phương pháp lỗi thời. Chúng tôi chỉ hỗ trợ khôi phục kho khóa trên lần phóng đầu tiên. Sau khi tạo ví đầu tiên, có thể xuất ví cũ từ cụm hạt giống.",
  "No matches": "Không có trận đấu",
  "Select or enter a new one": "Chọn hoặc nhập một cái mới",
  "Own addresses": "Địa chỉ riêng",
  "Retrieving transactions period (in minutes)": "Lấy lại thời gian giao dịch (tính bằng phút)",
  "Fee": "Phí",
  "Total": "Toàn bộ",
  "Destination": "Điểm đến",
  "Enter your pin code": "Nhập mã PIN của bạn",
  "Pin code (4-8 numbers)": "Mã PIN (số 4-8)",
  "Pin code contains 4-8 numbers. After 1 failed attempt it will be dropped. Login will be carried out through the password entry form. Pin code can be set up again on the settings page.": "Mã PIN chứa 4-8 số. Sau 1 lần thất bại, nó sẽ bị loại bỏ. Đăng nhập sẽ được thực hiện thông qua biểu mẫu nhập mật khẩu. Mã PIN có thể được thiết lập lại trên trang Cài đặt.",
  "Clear": "Thông thoáng",
  "Incorrect pin code": "Mã PIN không chính xác",
  "Submit": "Nộp",
  "Select permissions that you will grant to this web domain": "Chọn quyền mà bạn sẽ cấp cho miền Web này",
  "Origin": "Nguồn gốc",
  "Grant": "Khoản trợ cấp",
  "Web page will be able to know the provider state": "Trang web sẽ có thể biết trạng thái nhà cung cấp",
  "Method to get permissions granted by user": "Phương pháp để có quyền được cấp bởi người dùng",
  "Method to request needed permissions from user": "Phương thức yêu cầu quyền cần thiết từ người dùng",
  "Web page will be able to know the selected account": "Trang web sẽ có thể biết tài khoản đã chọn",
  "Web page will be able to know the selected endpoint": "Trang web sẽ có thể biết điểm cuối đã chọn",
  "Web page will be able to initialize the transaction dialog": "Trang web sẽ có thể khởi tạo hộp thoại giao dịch",
  "Web page will be able to subscribe on blockchain events": "Trang web sẽ có thể đăng ký vào các sự kiện blockchain",
  "Web page will be able to initialize the signing message dialog": "Trang web sẽ có thể khởi tạo hộp thoại thông báo ký",
  "Web page will be able to initialize the encrypting message dialog": "Trang web sẽ có thể khởi tạo hộp thoại Mã hóa mã hóa",
  "Web page will be able to initialize the decrypting message dialog": "Trang web sẽ có thể khởi tạo hộp thoại Tin nhắn giải mã",
  "Web page will be able to run generate_random_bytes method from crypto module": "Trang web sẽ có thể chạy phương thức Gener_random_bytes từ mô-đun Crypto",
  "Web page will be able to initialize the dialog for obtaining user signature": "Trang web sẽ có thể khởi tạo hộp thoại để lấy chữ ký của người dùng",
  "Web page will be able to unsubscribe on blockchain events": "Trang web sẽ có thể hủy đăng ký các sự kiện blockchain",
  "Method uses private keys": "Phương pháp sử dụng các phím riêng",
  "Web page requests invalid permissions": "Trang web yêu cầu Quyền không hợp lệ",
  "Please, confirm this signing only if you trust this web-page": "Vui lòng, xác nhận việc ký tên này nếu bạn tin tưởng trang web này",
  "Web page will be able to obtain the public key for ton_encryptMessage method": "Trang web sẽ có thể có được khóa công khai cho phương thức ton_encryptMessage",
  "Please, confirm this encryption process only if you trust this web-page": "Vui lòng, hãy xác nhận quy trình mã hóa này chỉ khi bạn tin tưởng trang web này",
  "Please, confirm this decryption process only if you trust this web-page": "Vui lòng chỉ cần xác nhận quy trình giải mã này nếu bạn tin tưởng trang web này",
  "Encrypt": "Mã hóa",
  "Decrypt": "Giải mã",
  "Send to this web-page": "Gửi đến trang web này",
  "Disclose": "Tiết lộ.",
  "Sign": "Ra hiệu",
  "Please, provide information about your current account (address and public key) only if you trust this web-page": "Vui lòng cung cấp thông tin về tài khoản hiện tại của bạn (địa chỉ và khóa công khai) Nếu bạn tin tưởng trang web này",
  "Please, provide information about your current endpoint only if you trust this web-page": "Vui lòng cung cấp thông tin về điểm cuối hiện tại của bạn nếu bạn tin tưởng trang web này",
  "Please, provide information about your nacl public key only if you trust this web-page": "Vui lòng, cung cấp thông tin về khóa công khai NaCl của bạn nếu bạn tin tưởng trang web này",
  "Provide": "Cung cấp",
  "incoming": "mới đến",
  "transfer": "chuyển khoản",
  "deploy": "triển khai",
  "error": "lỗi",
  "Amount can't be less than 0,001": "Số tiền không thể nhỏ hơn 0,001",
  "Amount can't be more than you have": "Số tiền không thể nhiều hơn bạn có",
  "Native": "Tự nhiên",
  "Import token": "Nhập mã thông báo",
  "Import": "Nhập khẩu",
  "Symbol": "Biểu tượng",
  "Icon": "Biểu tượng",
  "Type": "Thể loại",
  "Decimals of precision": "Số thập phân của độ chính xác.",
  "tokenIncoming": "mới đến",
  "tokenTransfer": "chuyển khoản",
  "Delete selected networks": "Xóa các mạng đã chọn",
  "Delete selected assets": "Xóa tài sản đã chọn",
  "Manage networks": "Quản lý mạng",
  "Manage tokens": "Quản lý mã thông báo",
  "Tokens": "Tokens.",
  "Networks": "Mạng",
  "No tokens that you can remove": "Không có mã thông báo nào bạn có thể loại bỏ",
  "No networks that you can remove": "Không có mạng mà bạn có thể loại bỏ",
  "Enable TON proxy": "Bật proxy tấn",
  "Send raw transaction": "Gửi giao dịch thô",
  "State init": "Tiểu bang",
  "Currency to display asset cost": "Tiền tệ để hiển thị chi phí tài sản",
  "QR code": "mã QR",
  "Send the link": "Gửi liên kết",
  "Close": "Đóng",
  "Copy": "Sao chép",
  "Send from XTON wallet": "Gửi từ ví Xton",
  "Empty list": "Danh sách trống",
  "Waiting for the transaction confirmation on the blockchain": "Chờ xác nhận giao dịch trên blockchain",
  "Update transactions list": "Cập nhật danh sách giao dịch"
}
